Repository: inoribea/astroquery-cli
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr, ja

source: Available ESASky Missions/Catalogs
fr: Missions/Catalogues ESASky disponibles
ja: 利用可能なESASkyミッション/カタログ

source: [yellow]Could not retrieve mission list or list is empty.[/yellow]
fr: [yellow]Impossible de récupérer la liste des missions ou la liste est vide.[/yellow][yellow]Impossible de récupérer la liste des missions ou la liste est vide.[/yellow]
ja: [yellow]ミッションリストを取得できませんでした、またはリストが空です。[/yellow][yellow]ミッションリストを取得できなかったか、リストが空です。[/yellow]

source: ESASky list_catalogs
fr: ESASky lister les catalogues

source: Query the European Southern Observatory archive.
fr: Interroger les archives de l'Observatoire Européen Austral.
ja: ヨーロッパ南天天文台のアーカイブを照会します。

source: Usage:
fr: Utilisation :
ja: 使用法:

source: Perform a query on ESO archive.
fr: Effectuer une requête sur les archives de l'ESO.
ja: ESOアーカイブでクエリを実行します。

source: Object name to query (e.g., 'M31').
fr: Nom de l'objet à interroger (par exemple, 'M31').
ja: 照会するオブジェクト名（例：'M31'）。

source: Right Ascension in degrees.
fr: Ascension droite en degrés.
ja: 度単位の赤経。

source: Declination in degrees.
fr: Déclinaison en degrés.
ja: 度単位の赤緯。

source: Search radius in degrees (for cone search).
fr: Rayon de recherche en degrés (pour la recherche conique).
ja: 度単位の検索半径（コーンサーチ用）。

source: Instrument name (e.g., 'FORS2').
fr: Nom de l'instrument (par exemple, 'FORS2').
ja: 機器名（例：'FORS2'）。

source: Querying ESO archive...
fr: Interrogation des archives de l'ESO...
ja: ESOアーカイブを照会中...

source: [red]Error: --radius is required when --ra and --dec are provided for a cone search.[/red]
fr: [red]Erreur : --radius est requis lorsque --ra et --dec sont fournis pour une recherche par cône.[/red]
ja: [red]エラー：コーンサーチで--raと--decが提供されている場合、--radiusが必要です。[/red]

source: [red]Error: Please provide either --object-name or both --ra and --dec (with --radius).[/red]
fr: [red]Erreur : Veuillez fournir soit --object-name, soit à la fois --ra et --dec (avec --radius).[/red][red]Erreur : Veuillez fournir soit --object-name, soit à la fois --ra et --dec (avec --radius).[/red]
ja: [red]エラー：--object-name、または--raと--decの両方（--radiusとともに）のいずれかを指定してください。[/red][red]エラー：--object-nameまたは--raと--dec（--radius付き）の両方を指定してください。[/red]

source: [green]Found {count} result(s) from ESO.[/green]
fr: [green]{count} résultat(s) trouvé(s) dans l'ESO.[/green]
ja: ESOから{count}件の結果が見つかりました。

source: ESO Query Results
fr: Résultats de la requête ESO
ja: ESOクエリ結果

source: ESO query
fr: Requête ESO
ja: ESOクエリ

source: [yellow]No results found for your ESO query.[/yellow]
fr: [yellow]Aucun résultat trouvé pour votre requête ESO.[/yellow]
ja: あなたのESOクエリの結果は見つかりませんでした。

source: List available ESO instruments.
fr: Lister les instruments ESO disponibles.
ja: 利用可能なESO機器をリストします。

source: Listing ESO instruments...
fr: Liste des instruments ESO...
ja: ESO機器をリスト表示中...

source: [green]Available ESO Instruments:[/green]
fr: [green]Instruments ESO disponibles :[/green]
ja: [green]利用可能なESO機器：[/green]

source: [yellow]No ESO instruments found.[/yellow]
fr: [yellow]Aucun instrument ESO trouvé.[/yellow]
ja: ESO機器は見つかりませんでした。

source: ESO list instruments
fr: ESO liste des instruments
ja: ESO機器リスト

source: Query the NASA Exoplanet Archive.
fr: Interroger les archives d'exoplanètes de la NASA.
ja: NASA系外惑星アーカイブを照会します。

source: Query the NASA Exoplanet Archive for a specific planet.
fr: Interroger l'archive d'exoplanètes de la NASA pour une planète spécifique.
ja: NASA系外惑星アーカイブで特定の惑星をクエリします。

source: Planet name (e.g., 'Kepler-186 f').
fr: Nom de la planète (ex : 'Kepler-186 f').
ja: 惑星名（例：'Kepler-186 f'）。

source: Querying NASA Exoplanet Archive...
fr: Interrogation des archives d'exoplanètes de la NASA...
ja: NASA系外惑星アーカイブを照会中...

source: [green]Found {count} result(s) from NASA Exoplanet Archive.[/green]
fr: [green]{count} résultat(s) trouvé(s) dans les archives d'exoplanètes de la NASA.[/green]
ja: NASA系外惑星アーカイブから{count}件の結果が見つかりました。

source: NASA Exoplanet Archive Query Results
fr: Résultats de la requête des archives d'exoplanètes de la NASA
ja: NASA系外惑星アーカイブクエリ結果

source: NASA Exoplanet Archive query
fr: Requête des archives d'exoplanètes de la NASA
ja: NASA系外惑星アーカイブクエリ

source: [yellow]No results found for your NASA Exoplanet Archive query.[/yellow]
fr: [yellow]Aucun résultat trouvé pour votre requête des archives d'exoplanètes de la NASA.[/yellow]
ja: NASA系外惑星アーカイブクエリの結果は見つかりませんでした。

source: Query the Gaia archive.
fr: Interroger l'archive Gaia.
ja: Gaiaアーカイブをクエリします。

source: Query Gaia main source for a given object name or coordinates.
fr: Interroger la source principale Gaia pour un nom d'objet ou des coordonnées donnés.Interroger la source principale de Gaia pour un nom d'objet ou des coordonnées donnés.
ja: 指定された天体名または座標のGaia主光源をクエリします。

source: Object name or coordinates (e.g., 'M31', '10.68h +41.26d').
fr: Nom de l'objet ou coordonnées (ex : 'M31', '10.68h +41.26d').
ja: 天体名または座標（例：'M31', '10.68h +41.26d'）。

source: Search radius for matching Gaia source (e.g., '5arcsec', '0.001deg').
fr: Rayon de recherche pour la source Gaia correspondante (ex : '5arcsec', '0.001deg').Rayon de recherche pour la source Gaia correspondante (par exemple, '5arcsec', '0.001deg').
ja: Gaiaソースを一致させるための検索半径（例：'5arcsec', '0.001deg'）。

source: Gaia table to query. Default: gaiadr3.gaia_source
fr: Table Gaia à interroger. Par défaut : gaiadr3.gaia_source
ja: クエリするGaiaテーブル。デフォルト：gaiadr3.gaia_source

source: Columns to retrieve (e.g., 'source_id', 'ra', 'dec', 'parallax').
fr: Colonnes à récupérer (ex : 'source_id', 'ra', 'dec', 'parallax').Colonnes à récupérer (par exemple, 'source_id', 'ra', 'dec', 'parallax').
ja: 取得する列（例：'source_id', 'ra', 'dec', 'parallax'）。

source: Invalid radius provided.
fr: Rayon non valide fourni.
ja: 無効な半径が指定されました。

source: [cyan]Querying Gaia for object: {target}...[/cyan]
fr: [cyan]Interrogation de Gaia pour l'objet : ...[/cyan]
ja: [cyan]Gaiaでオブジェクトをクエリ中：...[/cyan]

source: Gaia Main Source for '{target}'
fr: Source principale Gaia pour ''
ja: '' のGaia主光源

source: Gaia object query
fr: Requête objet Gaia
ja: Gaiaオブジェクトクエリ

source: [yellow]No Gaia source found for '{target}' in the given radius.[/yellow]
fr: [yellow]Aucune source Gaia trouvée pour '' dans le rayon donné.[/yellow][yellow]Aucune source Gaia trouvée pour '{target}' dans le rayon donné.[/yellow]
ja: [yellow]指定された半径で '' のGaiaソースが見つかりませんでした。[/yellow][yellow]指定されたbibcodeに一致する天体は見つかりませんでした。[/yellow]

source: Perform a cone search around a coordinate.
fr: Effectuer une recherche conique autour d'une coordonnée.
ja: 座標の周りでコーンサーチを実行します。

source: Central object name or coordinates (e.g., 'M31', '10.68h +41.26d').
fr: Nom ou coordonnées de l'objet central (ex : 'M31', '10.68h +41.26d').Nom de l'objet central ou coordonnées (par exemple, 'M31', '10.68h +41.26d').
ja: 中心天体名または座標（例：'M31', '10.68h +41.26d'）。

source: Search radius (e.g., '5arcmin', '0.1deg').
fr: Rayon de recherche (ex : '5arcmin', '0.1deg').
ja: 検索半径（例：'5arcmin', '0.1deg'）。

source: Gaia table to query. Common choices: {choices} or specify full table name.
fr: Table Gaia à interroger. Choix courants : ou spécifier le nom complet de la table.Table Gaia à interroger. Choix courants : {choices} ou spécifier le nom complet de la table.
ja: クエリするGaiaテーブル。一般的な選択肢：、または完全なテーブル名を指定します。照会するGaiaテーブル。一般的な選択肢: {choices} または完全なテーブル名を指定します。

source: Specific columns to retrieve (e.g., 'source_id', 'ra', 'dec', 'pmra'). Default: all columns from the table for a small radius, or a default set for larger radii.
fr: Colonnes spécifiques à récupérer (ex : 'source_id', 'ra', 'dec', 'pmra'). Par défaut : toutes les colonnes de la table pour un petit rayon, ou un ensemble par défaut pour des rayons plus grands.Colonnes spécifiques à récupérer (par exemple, 'source_id', 'ra', 'dec', 'pmra'). Par défaut : toutes les colonnes de la table pour un petit rayon, ou un ensemble par défaut pour des rayons plus grands.
ja: 取得する特定の列（例：'source_id', 'ra', 'dec', 'pmra'）。デフォルト：小半径の場合はテーブルの全列、大半径の場合はデフォルトセット。取得する特定の列 (例: 'source_id', 'ra' (赤経), 'dec' (赤緯), 'pmra' (赤経方向の固有運動))。デフォルト: 小さな半径の場合はテーブルのすべての列、大きな半径の場合はデフォルトセット。

source: Maximum number of rows to return from the server.
fr: Nombre maximal de lignes à retourner du serveur.
ja: サーバーから返される最大行数。

source: Gaia archive username (or set GAIA_USER env var).
fr: Nom d'utilisateur de l'archive Gaia (ou définir la variable d'environnement GAIA_USER).Nom d'utilisateur de l'archive Gaia (ou définir la variable d'environnement GAIA_USER).
ja: Gaiaアーカイブユーザー名（またはGAIA_USER環境変数を設定）。

source: Gaia archive password (or set GAIA_PASSWORD env var). Prompt if user set but no password.
fr: Mot de passe de l'archive Gaia (ou définir la variable d'environnement GAIA_PASSWORD). Demande si l'utilisateur est défini mais pas de mot de passe.Mot de passe de l'archive Gaia (ou définir la variable d'environnement GAIA_PASSWORD). Demander si l'utilisateur est défini mais pas de mot de passe.
ja: Gaiaアーカイブパスワード（またはGAIA_PASSWORD環境変数を設定）。ユーザーが設定しているがパスワードがない場合はプロンプトを表示します。Gaia アーカイブのパスワード (または GAIA_PASSWORD 環境変数を設定)。ユーザーが設定されていてパスワードがない場合はプロンプトを表示します。

source: [cyan]Performing Gaia cone search on '{table_name}' around '{target}' with radius {radius}...[/cyan]
fr: [cyan]Effectuant une recherche conique Gaia sur '' autour de '' avec un rayon ...[/cyan][cyan]Effectuer une recherche conique Gaia sur '{table_name}' autour de '{target}' avec un rayon de {radius}...[/cyan]
ja: [cyan]半径 で '' 周辺の '' でGaiaコーンサーチを実行中...[/cyan][cyan]'{table_name}' テーブルで '{target}' の周囲 (半径 {radius}) のGaiaコーンサーチを実行中...[/cyan]

source: Gaia archive password
fr: Mot de passe de l'archive Gaia
ja: Gaiaアーカイブパスワード

source: Logging into Gaia archive as '{user}'...
fr: Connexion à l'archive Gaia en tant que ''...
ja: Gaiaアーカイブに''としてログイン中...

source: [bold red]Gaia login failed: {error}[/bold red]
fr: [bold red]Échec de la connexion Gaia : [/bold red]
ja: [bold red]Gaiaログイン失敗：[/bold red]

source: [yellow]Proceeding with anonymous access if possible.[/yellow]
fr: [yellow]Poursuite avec accès anonyme si possible.[/yellow]
ja: [yellow]可能であれば匿名アクセスで続行します。[/yellow]

source: Already logged into Gaia archive as '{user}'.
fr: Déjà connecté à l'archive Gaia en tant que ''.
ja: Gaiaアーカイブに''として既にログインしています。

source: unknown user
fr: utilisateur inconnu
ja: 不明なユーザー

source: No Gaia login credentials provided. Using anonymous access.
fr: Aucune information de connexion Gaia fournie. Accès anonyme utilisé.
ja: Gaiaログイン認証情報が提供されていません。匿名アクセスを使用します。

source: [bold red]Invalid radius provided.[/bold red]
fr: [bold red]Rayon non valide fourni.[/bold red]
ja: [bold red]無効な半径が指定されました。[/bold red]

source: Executing ADQL query (first {row_limit} rows):
fr: Exécution de la requête ADQL (premières lignes) :
ja: ADQLクエリを実行中（最初の行）：

source: Gaia Cone Search Results ({table_name})
fr: Résultats de la recherche conique Gaia ()
ja: Gaiaコーンサーチ結果 ()

source: (User: {user})
fr: (Utilisateur: {user})
ja: (ユーザー: {user})

source: Gaia cone search
fr: Recherche conique Gaia
ja: Gaiaコーンサーチ

source: [yellow]No results found from Gaia for this cone search.[/yellow]
fr: [yellow]Aucun résultat trouvé de Gaia pour cette recherche conique.[/yellow][yellow]Aucun résultat trouvé de Gaia pour cette recherche conique.[/yellow]
ja: [yellow]このコーンサーチではGaiaから結果が見つかりませんでした。[/yellow][yellow]このコーンサーチではGaiaから結果が見つかりませんでした。[/yellow]

source: Gaia cone search on {table_name}
fr: Recherche conique Gaia sur
ja: でのGaiaコーンサーチ

source: Logged out from Gaia archive.
fr: Déconnecté des archives Gaia.
ja: ガイアアーカイブからログアウトしました。

source: Execute a raw ADQL query (synchronous).
fr: Exécuter une requête ADQL brute (synchrone).
ja: 生のADQLクエリを実行します（同期）。

source: The ADQL query string.
fr: La chaîne de requête ADQL.
ja: ADQLクエリ文字列。

source: [cyan]Executing Gaia ADQL query...[/cyan]
fr: [cyan]Exécution de la requête ADQL Gaia...[/cyan]
ja: [cyan]Gaia ADQLクエリを実行中...[/cyan]

source: Gaia ADQL Query Results
fr: Résultats de la requête ADQL Gaia
ja: Gaia ADQLクエリ結果

source: Gaia ADQL query
fr: Requête ADQL Gaia
ja: Gaia ADQLクエリ

source: [yellow]ADQL query returned no results or an empty table.[/yellow]
fr: [yellow]La requête ADQL n'a retourné aucun résultat ou une table vide.[/yellow][yellow]La requête ADQL n'a renvoyé aucun résultat ou une table vide.[/yellow]
ja: [yellow]ADQLクエリは結果を返さなかったか、空のテーブルを返しました。[/yellow][yellow]ADQLクエリは結果を返さなかったか、空のテーブルを返しました。[/yellow]

source: [bold red]ADQL Query Error Details from server: {error_details}[/bold red]
fr: [bold red]Détails de l'erreur de requête ADQL du serveur : {error_details}[/bold red]
ja: [bold red]サーバーからのADQLクエリエラー詳細: {error_details}[/bold red]

source: Query the HEASARC database.
fr: Interroger la base de données HEASARC.
ja: HEASARCデータベースを照会します。

source: Maximum number of rows to retrieve from the HEASARC database. Use -1 for all rows.
fr: Nombre maximum de lignes à récupérer de la base de données HEASARC. Utilisez -1 pour toutes les lignes.
ja: HEASARCデータベースから取得する行の最大数。すべての行には-1を使用します。

source: Query a specific HEASARC mission. Use 'heasarc list' to see available missions.
fr: Interroger une mission HEASARC spécifique. Utilisez 'heasarc list' pour voir les missions disponibles.Interroger une mission HEASARC spécifique. Utilisez 'heasarc list' pour voir les missions disponibles.
ja: 特定のHEASARCミッションをクエリします。利用可能なミッションを見るには 'heasarc list' を使用してください。特定のHEASARCミッションをクエリします。利用可能なミッションを見るには'heasarc list'を使用してください。

source: HEASARC mission name (e.g., 'atnfpsr').
fr: Nom de la mission HEASARC (ex : 'atnfpsr').
ja: HEASARCミッション名（例：'atnfpsr'）。

source: Querying HEASARC mission: {mission}...
fr: Interrogation de la mission HEASARC : ...
ja: HEASARCミッションをクエリ中: ...

source: [green]Found {count} result(s) from HEASARC.[/green]
fr: [green]{count} résultat(s) trouvé(s) dans HEASARC.[/green]
ja: HEASARCから{count}件の結果が見つかりました。

source: HEASARC Query Results
fr: Résultats de la requête HEASARC
ja: HEASARCクエリ結果

source: HEASARC query
fr: Requête HEASARC
ja: HEASARCクエリ

source: [yellow]No results found for your HEASARC query.[/yellow]
fr: [yellow]Aucun résultat trouvé pour votre requête HEASARC.[/yellow]
ja: あなたのHEASARCクエリの結果は見つかりませんでした。

source: List available HEASARC missions.
fr: Lister les missions HEASARC disponibles.
ja: 利用可能なHEASARCミッションをリストします。

source: Filter missions by a starting prefix (e.g., 'atnfpsr').
fr: Filtrer les missions par un préfixe de début (ex : 'atnfpsr').
ja: 先頭のプレフィックス（例：'atnfpsr'）でミッションをフィルタリングします。

source: Listing HEASARC missions...
fr: Liste des missions HEASARC...
ja: HEASARCミッションをリスト表示中...

source: [cyan]Filtered from {original_count} to {filtered_count} missions with prefix "{prefix}".[/cyan]
fr: [cyan]Filtré de à missions avec le préfixe "".[/cyan]
ja: [cyan]接頭辞""でからミッションにフィルタリングされました。[/cyan]

source: Available HEASARC Missions
fr: Missions HEASARC disponibles
ja: 利用可能なHEASARCミッション

source: [yellow]No HEASARC missions found matching your criteria.[/yellow]
fr: [yellow]Aucune mission HEASARC correspondant à vos critères n'a été trouvée.[/yellow]
ja: 条件に一致するHEASARCミッションは見つかりませんでした。

source: HEASARC list missions
fr: HEASARC liste des missions
ja: HEASARCミッションリスト

source: Query NASA/IPAC Infrared Science Archive
fr: Interroger les archives scientifiques infrarouges de la NASA/IPAC.
ja: NASA/IPAC赤外線科学アーカイブを照会します。

source: IRSA Gator catalog operations. Example: python -m astroquery_cli.main irsa gator query "83.822083 -5.391111" "30arcsec" --catalog fp_psc Use 'python -m astroquery_cli.main irsa gator list' to list all available catalogs.
fr: Opérations sur les catalogues IRSA Gator. Exemple : python -m astroquery_cli.main irsa gator query "83.822083 -5.391111" "30arcsec" --catalog fp_psc Utilisez 'python -m astroquery_cli.main irsa gator list' pour lister tous les catalogues disponibles.
ja: IRSA Gatorカタログ操作。 例: python -m astroquery_cli.main irsa gator query "83.822083 -5.391111" "30arcsec" --catalog fp_psc 利用可能なすべてのカタログをリストするには、'python -m astroquery_cli.main irsa gator list'を使用してください。

source: Coordinates (e.g., '00 42 44.3 +41 16 09') or catalog name (e.g., 'fp_psc').
fr: Coordonnées (ex : '00 42 44.3 +41 16 09') ou nom de catalogue (ex : 'fp_psc').Coordonnées (par exemple, '00 42 44.3 +41 16 09') ou nom de catalogue (par exemple, 'fp_psc').
ja: 座標（例：'00 42 44.3 +41 16 09'）またはカタログ名（例：'fp_psc'）。

source: Search radius (e.g., '10arcsec', '0.5deg'). Required if coordinates provided.
fr: Rayon de recherche (ex : '10arcsec', '0.5deg'). Obligatoire si des coordonnées sont fournies.
ja: 検索半径（例：'10arcsec', '0.5deg'）。座標が提供されている場合は必須です。

source: Explicitly specify the IRSA catalog name (e.g., 'allwise_p3as_psd'). Defaults to 'gaia_dr3_source'.
fr: Spécifier explicitement le nom du catalogue IRSA (ex : 'allwise_p3as_psd'). Par défaut : 'gaia_dr3_source'.Spécifiez explicitement le nom du catalogue IRSA (par exemple, 'allwise_p3as_psd'). Par défaut à 'gaia_dr3_source'.
ja: IRSAカタログ名を明示的に指定します（例：'allwise_p3as_psd'）。デフォルトは'gaia_dr3_source'です。IRSAカタログ名（例：「allwise_p3as_psd」）を明示的に指定します。デフォルトは「gaia_dr3_source」です。

source: Specific columns to retrieve (comma separated or multiple use). Use 'all' for all columns.
fr: Colonnes spécifiques à récupérer (séparées par des virgules ou à usages multiples). Utilisez 'all' pour toutes les colonnes.Colonnes spécifiques à récupérer (séparées par des virgules ou utilisation multiple). Utilisez 'all' pour toutes les colonnes.
ja: 取得する特定の列（カンマ区切りまたは複数使用）。すべての列については'all'を使用します。取得する特定の列。すべての列を取得するには 'all' を使用します。複数指定可能です。

source: Column filters (e.g., 'w1mpro>10', 'ph_qual=A'). Can be specified multiple times.
fr: Filtres de colonne (ex : 'w1mpro>10', 'ph_qual=A'). Peut être spécifié plusieurs fois.Filtres de colonnes (par exemple, 'w1mpro>10', 'ph_qual=A'). Peuvent être spécifiés plusieurs fois.
ja: 列フィルター（例：'w1mpro>10', 'ph_qual=A'）。複数回指定できます。

source: [yellow]No catalog specified with coordinates. Defaulting to 'gaia_dr3_source' catalog.[/yellow]
fr: [yellow]Aucun catalogue spécifié avec des coordonnées. Utilisation par défaut du catalogue 'gaia_dr3_source'.[/yellow][yellow]Aucun catalogue spécifié avec les coordonnées. Par défaut, le catalogue 'gaia_dr3_source' est utilisé.[/yellow]
ja: [yellow]座標でカタログが指定されていません。デフォルトで 'gaia_dr3_source' カタログを使用します。[/yellow][yellow]座標とともにカタログが指定されていません。デフォルトで「gaia_dr3_source」カタログを使用します。[/yellow]

source: [red]Error: Radius is required when coordinates are provided.[/red]
fr: [red]Erreur : Le rayon est requis lorsque des coordonnées sont fournies.[/red][rouge]Erreur : Le rayon est requis lorsque les coordonnées sont fournies.[/rouge]
ja: [red]エラー：座標が指定されている場合、半径は必須です。[/red]

source: [cyan]Querying IRSA catalog '{catalog}' via Gator for region: '{coordinates}' with radius '{radius}'...[/cyan]
fr: [cyan]Interrogation du catalogue IRSA '' via Gator pour la région : '' avec un rayon ''...[/cyan][cyan]Interrogation du catalogue IRSA '{catalog}' via Gator pour la région : '{coordinates}' avec un rayon de '{radius}'...[/cyan]
ja: [cyan]IRSAカタログ '' をGator経由で領域 ''、半径 '' でクエリ中...[/cyan][cyan]Gator経由でIRSAカタログ '{catalog}' の領域 '{coordinates}' (半径 '{radius}') を照会中...[/cyan]

source: [red]Error: Catalog name provided as both positional argument and --catalog option. Please use only one.[/red]
fr: [red]Erreur : Le nom de catalogue a été fourni à la fois comme argument positionnel et comme option --catalog. Veuillez n'en utiliser qu'un seul.[/red][red]Erreur : Le nom du catalogue a été fourni à la fois comme argument positionnel et comme option --catalog. Veuillez n'en utiliser qu'un seul.[/red]
ja: [red]エラー：カタログ名が位置引数と--catalogオプションの両方で提供されました。どちらか一方のみを使用してください。[/red][red]エラー: カタログ名が位置引数と--catalogオプションの両方で提供されています。どちらか一方のみを使用してください。[/red]

source: [red]Error: Catalog name '{target_input}' provided as first argument, but a radius '{radius}' was also provided. Catalog queries do not use radius. Please use 'irsa gator <catalog_name>' without a radius, or provide coordinates and a radius.[/red]
fr: [red]Erreur : Le nom de catalogue '' a été fourni comme premier argument, mais un rayon '' a également été fourni. Les requêtes de catalogue n'utilisent pas de rayon. Veuillez utiliser 'irsa gator <nom_catalogue>' sans rayon, ou fournir des coordonnées et un rayon.[/red][red]Erreur : Le nom du catalogue '' a été fourni comme premier argument, mais un rayon '' a également été fourni. Les requêtes de catalogue n'utilisent pas de rayon. Veuillez utiliser 'irsa gator <nom_du_catalogue>' sans rayon, ou fournir des coordonnées et un rayon.[/red]
ja: [red]エラー：カタログ名 '' が最初の引数として提供されましたが、半径 '' も提供されました。カタログクエリでは半径を使用しません。半径なしで 'irsa gator <catalog_name>' を使用するか、座標と半径を提供してください。[/red][red]エラー: カタログ名 '' が最初の引数として提供されましたが、半径 '' も提供されました。カタログクエリでは半径を使用しません。「irsa gator <catalog_name>」を半径なしで使用するか、座標と半径を提供してください。[/red]

source: [cyan]Browsing IRSA catalog '{catalog}' (first {limit} rows)...[/cyan]
fr: [cyan]Parcours du catalogue IRSA '' (premières lignes)...[/cyan][cyan]Interrogation de VizieR avec des contraintes dans le(s) catalogue(s) : {catalog_list}...[/cyan]
ja: [cyan]IRSAカタログ '' を閲覧中（最初の 行）...[/cyan]

source: [green]Found {count} match(es) in '{catalog}'.[/green]
fr: [green]Trouvé correspondance(s) dans ''.[/green]
ja: [green]'' で 件の一致が見つかりました。[/green]

source: IRSA Gator: {catalog}
fr: IRSA Gator :
ja: IRSA Gator:

source: IRSA Gator {catalog} query
fr: Requête IRSA Gator
ja: IRSA Gator クエリ

source: [yellow]No information found in '{catalog}' for the specified region.[/yellow]
fr: [yellow]Aucune information trouvée dans '' pour la région spécifiée.[/yellow][yellow]Aucune information trouvée dans '{catalog}' pour la région spécifiée.[/yellow]
ja: [yellow]指定された領域の '' の情報は見つかりませんでした。[/yellow][yellow]'{catalog}' に指定された領域の情報は見つかりませんでした。[/yellow]

source: IRSA Gator query for catalog {catalog}
fr: Requête IRSA Gator pour le catalogue
ja: カタログ のIRSA Gatorクエリ

source: Perform a cone search across multiple IRSA collections.
fr: Effectuer une recherche conique dans plusieurs collections IRSA.
ja: 複数のIRSAコレクションに対してコーンサーチを実行します。

source: Coordinates (e.g., '10.68h +41.26d', 'M31').
fr: Coordonnées (ex : '10.68h +41.26d', 'M31').
ja: 座標（例：'10.68h +41.26d', 'M31'）。

source: Search radius (e.g., '10arcsec', '0.5deg').
fr: Rayon de recherche (ex : '10arcsec', '0.5deg').
ja: 検索半径（例：'10arcsec', '0.5deg'）。

source: Specify a collection (e.g., 'allwise', '2MASS'). Leave blank for a general search.
fr: Spécifier une collection (ex : 'allwise', '2MASS'). Laisser vide pour une recherche générale.Spécifier une collection (par exemple, 'allwise', '2MASS'). Laisser vide pour une recherche générale.
ja: コレクションを指定します（例：'allwise', '2MASS'）。一般検索の場合は空欄にしてください。コレクションを指定します (例: 'allwise', '2MASS')。一般的な検索の場合は空白のままにします。

source: [cyan]Performing IRSA cone search for region: '{coordinates}' with radius '{radius}'...[/cyan]
fr: [cyan]Effectuant une recherche conique IRSA pour la région : '' avec un rayon ''...[/cyan][cyan]Effectuer une recherche conique IRSA pour la région : '{coordinates}' avec un rayon de '{radius}'...[/cyan]
ja: [cyan]領域 '' で半径 '' のIRSAコーンサーチを実行中...[/cyan][cyan]領域 '{coordinates}'、半径 '{radius}' のIRSAコーンサーチを実行中...[/cyan]

source: [green]Found {count} match(es) in IRSA holdings.[/green]
fr: [green]Trouvé correspondance(s) dans les avoirs IRSA.[/green]
ja: [green]IRSA保有データで 件の一致が見つかりました。[/green]

source: IRSA Cone Search Results
fr: Résultats de la recherche conique IRSA
ja: IRSAコーンサーチ結果

source: IRSA cone search query
fr: Requête de recherche conique IRSA
ja: IRSAコーンサーチクエリ

source: [yellow]No information found in IRSA for the specified region{collection_info}.[/yellow]
fr: [yellow]Aucune information trouvée dans IRSA pour la région spécifiée.[/yellow][yellow]Aucune information trouvée dans IRSA pour la région spécifiée{collection_info}.[/yellow]
ja: [yellow]指定された領域のIRSAに情報が見つかりませんでした。[/yellow][yellow]IRSAに指定された領域{collection_info}の情報は見つかりませんでした。[/yellow]

source: in collection {collection}
fr: dans la collection {collection}
ja: コレクション {collection} 内

source: IRSA query_region
fr: IRSA interroger la région
