Repository: inoribea/astroquery-cli
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr, ja

source: NED Image List for {object_name}
fr: Liste d'images NED pour
ja: のNED画像リスト

source: NED image list query
fr: Requête de liste d'images NED
ja: NED画像リストクエリ

source: [yellow]No image entries found for object '{object_name}'.[/yellow]
fr: [yellow]Aucune entrée d'image trouvée pour l'objet ''.[/yellow][yellow]Aucune entrée d'image trouvée pour l'objet '{object_name}'.[/yellow]
ja: [yellow]オブジェクト '' の画像エントリが見つかりませんでした。[/yellow][yellow]天体 '{object_name}' の画像エントリは見つかりませんでした。[/yellow]

source: NED images
fr: Images NED
ja: NED画像

source: Query the NIST Atomic Spectra Database.
fr: Interroger la base de données NIST Atomic Spectra.
ja: NIST原子スペクトルデータベースを照会します。

source: Primary query input: wavelength range (e.g., '2000 3000') or line name (e.g., 'Fe II').
fr: Entrée de requête principale : plage de longueurs d'onde (ex : '2000 3000') ou nom de raie (ex : 'Fe II').
ja: 主クエリ入力：波長範囲（例：'2000 3000'）または輝線名（例：'Fe II'）。

source: Explicit minimum wavelength (e.g., 2000). Overrides any wavelength range parsed from 'query_string'. Can be combined with '--linename'.
fr: Longueur d'onde minimale explicite (ex : 2000). Annule toute plage de longueurs d'onde analysée à partir de 'query_string'. Peut être combinée avec '--linename'.
ja: 明示的な最小波長（例：2000）。'query_string'から解析されたすべての波長範囲を上書きします。'--linename'と組み合わせることができます。

source: Explicit maximum wavelength (e.g., 3000). Overrides any wavelength range parsed from 'query_string'. Can be combined with '--linename'.
fr: Longueur d'onde maximale explicite (ex : 3000). Annule toute plage de longueurs d'onde analysée à partir de 'query_string'. Peut être combinée avec '--linename'.
ja: 明示的な最大波長（例：3000）。'query_string'から解析されたすべての波長範囲を上書きします。'--linename'と組み合わせることができます。

source: Explicit line name (e.g., 'Fe II', 'H I'). Overrides any line name parsed from 'query_string'. Can be combined with explicit '--minwav' and '--maxwav' for a specific range.
fr: Nom de raie explicite (ex : 'Fe II', 'H I'). Annule tout nom de raie analysé à partir de 'query_string'. Peut être combiné avec '--minwav' et '--maxwav' explicites pour une plage spécifique.
ja: 明示的な輝線名（例：'Fe II', 'H I'）。'query_string'から解析されたすべての輝線名を上書きします。特定の範囲を指定するために、明示的な'--minwav'および'--maxwav'と組み合わせることができます。

source: [red]Error: Wavelength range (MINWAV and MAXWAV) must be provided either as arguments or implicitly via a line name query.[/red]
fr: [red]Erreur : La plage de longueurs d'onde (MINWAV et MAXWAV) doit être fournie soit comme arguments, soit implicitement via une requête par nom de raie.[/red]
ja: [red]エラー：波長範囲（MINWAVとMAXWAV）は、引数として、または線名クエリを介して暗黙的に提供される必要があります。[/red]

source: Querying NIST Atomic Spectra Database...
fr: Interrogation de la base de données NIST Atomic Spectra...
ja: NIST原子スペクトルデータベースを照会中...

source: [green]Found {count} result(s) from NIST.[/green]
fr: [green]{count} résultat(s) trouvé(s) dans le NIST.[/green]
ja: NISTから{count}件の結果が見つかりました。

source: NIST Query Results
fr: Résultats de la requête NIST
ja: NISTクエリ結果

source: NIST query
fr: Requête NIST
ja: NISTクエリ

source: [yellow]No results found for your NIST query.[/yellow]
fr: [yellow]Aucun résultat trouvé pour votre requête NIST.[/yellow]
ja: あなたのNISTクエリの結果は見つかりませんでした。

source: Query the Sloan Digital Sky Survey database.
fr: Interroger la base de données du Sloan Digital Sky Survey.
ja: スローン・デジタル・スカイ・サーベイデータベースを照会します。

source: Right Ascension (e.g., '10.5 deg', '0h42m30s'). Required for cone search.
fr: Ascension droite (ex : '10.5 deg', '0h42m30s'). Obligatoire pour la recherche conique.Ascension droite (par exemple, '10.5 deg', '0h42m30s'). Requis pour une recherche conique.
ja: 赤経（例：'10.5 deg', '0h42m30s'）。コーンサーチに必要です。

source: Declination (e.g., '20.1 deg', '+41d12m0s'). Required for cone search.
fr: Déclinaison (ex. : '20.1 deg', '+41d12m0s'). Obligatoire pour la recherche par cône.
ja: 赤緯（例：'20.1 deg'、'+41d12m0s'）。コーンサーチに必須。

source: Search radius (e.g., '0.5 deg', '2 arcmin'). Max 3 arcmin. Required for cone search.
fr: Rayon de recherche (ex. : '0.5 deg', '2 arcmin'). Max 3 arcmin. Obligatoire pour la recherche par cône.
ja: 検索半径（例：'0.5 deg'、'2 arcmin'）。最大3 arcmin。コーンサーチに必須。

source: Object type (e.g., 'STAR', 'GALAXY', 'QSO'). Note: This parameter is only applicable for queries using specobjid or plate/mjd/fiberid, not for cone searches.
fr: Type d'objet (ex : 'STAR', 'GALAXY', 'QSO'). Note : Ce paramètre est applicable uniquement aux requêtes utilisant specobjid ou plate/mjd/fiberid, et non aux recherches coniques.Type d'objet (par exemple, 'STAR', 'GALAXY', 'QSO'). Remarque : Ce paramètre n'est applicable que pour les requêtes utilisant specobjid ou plate/mjd/fiberid, pas pour les recherches coniques.
ja: オブジェクトタイプ（例：'STAR'、'GALAXY'、'QSO'）。注：このパラメータは、specobjidまたはplate/mjd/fiberidを使用したクエリにのみ適用され、コーンサーチには適用されません。オブジェクトタイプ（例：'STAR'、'GALAXY'、'QSO'）。注：このパラメータはspecobjidまたはplate/mjd/fiberidを使用したクエリにのみ適用され、コーンサーチには適用されません。

source: Spectroscopic object ID. Required for specobjid search.
fr: ID d'objet spectroscopique. Obligatoire pour la recherche par specobjid.
ja: 分光オブジェクトID。specobjid検索に必要です。

source: Plate number for spectroscopic data. Required for fiber ID search.
fr: Numéro de plaque pour les données spectroscopiques. Obligatoire pour la recherche par ID de fibre.Numéro de plaque pour les données spectroscopiques. Requis pour une recherche par ID de fibre.
ja: 分光データ用のプレート番号。ファイバーID検索に必要です。

source: Modified Julian Date for spectroscopic data. Required for fiber ID search.
fr: Date Julienne Modifiée pour les données spectroscopiques. Obligatoire pour la recherche par ID de fibre.Date julienne modifiée pour les données spectroscopiques. Requis pour une recherche par ID de fibre.
ja: 分光データ用の修正ユリウス日。ファイバーID検索に必要です。

source: Fiber ID for spectroscopic data. Required for fiber ID search.
fr: ID de fibre pour les données spectroscopiques. Obligatoire pour la recherche par ID de fibre.ID de fibre pour les données spectroscopiques. Requis pour une recherche par ID de fibre.
ja: 分光データ用のファイバーID。ファイバーID検索に必要です。

source: Querying SDSS...
fr: Interrogation de SDSS...
ja: SDSSをクエリ中...

source: [red]Error: For a cone search, --ra, --dec, and --radius are all required. Please provide all three.[/red]
fr: [red]Erreur : Pour une recherche conique, --ra, --dec et --radius sont tous requis. Veuillez fournir les trois.[/red][red]Erreur : Pour une recherche conique, --ra, --dec et --radius sont tous requis. Veuillez fournir les trois.[/red]
ja: [red]エラー：コーンサーチの場合、--ra、--dec、--radius はすべて必須です。これら3つすべてを提供してください。[/red][red]エラー：コーンサーチには--ra、--dec、--radiusのすべてが必要です。3つすべてを指定してください。[/red]

source: [red]Error: Cannot combine cone search parameters (--ra, --dec, --radius) with other query types (--specobjid or --plate, --mjd, --fiberid).[/red]
fr: [red]Erreur : Impossible de combiner les paramètres de recherche conique (--ra, --dec, --radius) avec d'autres types de requête (--specobjid ou --plate, --mjd, --fiberid).[/red][red]Erreur : Impossible de combiner les paramètres de recherche conique (--ra, --dec, --radius) avec d'autres types de requête (--specobjid ou --plate, --mjd, --fiberid).[/red]
ja: [red]エラー：コーンサーチパラメータ（--ra、--dec、--radius）を他のクエリタイプ（--specobjid または --plate、--mjd、--fiberid）と組み合わせることはできません。[/red][red]エラー：コーンサーチパラメータ（--ra、--dec、--radius）を他のクエリタイプ（--specobjidまたは--plate、--mjd、--fiberid）と組み合わせることはできません。[/red]

source: [red]Error: Cannot combine --specobjid with other query types (cone search or fiber ID search).[/red]
fr: [red]Erreur : Impossible de combiner --specobjid avec d'autres types de requête (recherche conique ou recherche par ID de fibre).[/red][red]Erreur : Impossible de combiner --specobjid avec d'autres types de requête (recherche conique ou recherche par ID de fibre).[/red]
ja: [red]エラー：--specobjid を他のクエリタイプ（コーンサーチまたはファイバーID検索）と組み合わせることはできません。[/red][red]エラー：--specobjidを他のクエリタイプ（コーンサーチまたはファイバーID検索）と組み合わせることはできません。[/red]

source: [red]Error: For a fiber ID search, --plate, --mjd, and --fiberid are all required. Please provide all three.[/red]
fr: [red]Erreur : Pour une recherche par ID de fibre, --plate, --mjd et --fiberid sont tous requis. Veuillez fournir les trois.[/red][red]Erreur : Pour une recherche par ID de fibre, --plate, --mjd et --fiberid sont tous requis. Veuillez fournir les trois.[/red]
ja: [red]エラー：ファイバーID検索の場合、--plate、--mjd、--fiberid はすべて必須です。これら3つすべてを提供してください。[/red][red]エラー：ファイバーID検索には--plate、--mjd、--fiberidのすべてが必要です。3つすべてを指定してください。[/red]

source: [red]Error: Cannot combine fiber ID search parameters (--plate, --mjd, --fiberid) with other query types (cone search or specobjid search).[/red]
fr: [red]Erreur : Impossible de combiner les paramètres de recherche par ID de fibre (--plate, --mjd, --fiberid) avec d'autres types de requête (recherche conique ou recherche par ID specobjid).[/red][red]Erreur : Impossible de combiner les paramètres de recherche par ID de fibre (--plate, --mjd, --fiberid) avec d'autres types de requête (recherche conique ou recherche par specobjid).[/red]
ja: [red]エラー：ファイバーID検索パラメータ（--plate、--mjd、--fiberid）を他のクエリタイプ（コーンサーチまたはspecobjid検索）と組み合わせることはできません。[/red][red]エラー：ファイバーID検索パラメータ（--plate、--mjd、--fiberid）を他のクエリタイプ（コーンサーチまたはspecobjid検索）と組み合わせることはできません。[/red]

source: [red]Error: No valid query parameters provided. Please specify parameters for one of the following query types: coordinates (--ra, --dec, --radius), or --specobjid, or --plate, --mjd, and --fiberid.[/red]
fr: [red]Erreur : Aucun paramètre de requête valide n'a été fourni. Veuillez spécifier les paramètres pour l'un des types de requête suivants : coordonnées (--ra, --dec, --radius), ou --specobjid, ou --plate, --mjd et --fiberid.[/red][red]Erreur : Aucun paramètre de requête valide fourni. Veuillez spécifier des paramètres pour l'un des types de requête suivants : coordonnées (--ra, --dec, --radius), ou --specobjid, ou --plate, --mjd et --fiberid.[/red]
ja: [red]エラー：有効なクエリパラメータが指定されていません。以下のクエリタイプのいずれかのパラメータを指定してください：座標（--ra, --dec, --radius）、または--specobjid、または--plate, --mjd, および --fiberid。[/red][red]エラー：有効なクエリパラメータが指定されていません。以下のクエリタイプのいずれかに対してパラメータを指定してください：座標（--ra、--dec、--radius）、または--specobjid、または--plate、--mjd、--fiberid。[/red]

source: [yellow]No results found for objtype '{objtype}' after filtering.[/yellow]
fr: [yellow]Aucun résultat trouvé pour objtype '{objtype}' après filtrage.[/yellow]
ja: フィルタリング後、objtype '{objtype}'に一致する結果は見つかりませんでした。

source: [green]Filtered {filtered_count} results for objtype '{objtype}' from {initial_count} total.[/green]
fr: [green]Filtré résultats pour le type d'objet '' sur au total.[/green][green]Filtré résultats pour le type d'objet '' sur au total.[/green]
ja: [green]オブジェクトタイプ '' の結果を、合計 件から 件にフィルタリングしました。[/green][green]合計件からobjtype ''の件の結果をフィルタリングしました。[/green]

source: [green]Found {count} result(s) from SDSS.[/green]
fr: [green]{count} résultat(s) trouvé(s) dans le SDSS.[/green]
ja: SDSSから{count}件の結果が見つかりました。

source: SDSS Query Results
fr: Résultats de la requête SDSS
ja: SDSSクエリ結果

source: SDSS query
fr: Requête SDSS
ja: SDSSクエリ

source: [yellow]No results found for your SDSS query.[/yellow]
fr: [yellow]Aucun résultat trouvé pour votre requête SDSS.[/yellow]
ja: あなたのSDSSクエリの結果は見つかりませんでした。

source: SIMBAD astronomical database.
fr: Base de données astronomique SIMBAD.
ja: SIMBAD天文データベース。

source: Query basic data for an astronomical object.
fr: Interroger les données de base pour un objet astronomique.
ja: 天体の基本データをクエリします。

source: Name of the object to query (e.g., 'M101', 'HD12345').
fr: Nom de l'objet à interroger (ex : 'M101', 'HD12345').
ja: クエリする天体名（例：'M101', 'HD12345'）。

source: Enable wildcard searching for the object name.
fr: Activer la recherche par caractères génériques pour le nom de l'objet.
ja: オブジェクト名にワイルドカード検索を有効にします。

source: Additional VOTable fields to retrieve (e.g., 'otype', 'sptype'). Can be specified multiple times.
fr: Champs VOTable additionnels à récupérer (ex : 'otype', 'sptype'). Peut être spécifié plusieurs fois.Champs VOTable supplémentaires à récupérer (par exemple, 'otype', 'sptype'). Peut être spécifié plusieurs fois.
ja: 取得する追加のVOTableフィールド（例：'otype', 'sptype'）。複数回指定できます。取得する追加のVOTableフィールド (例: 'otype' (天体種別), 'sptype' (スペクトル型))。複数指定可能です。

source: Default VOTable fields to remove (e.g., 'coo_bibcode'). Can be specified multiple times.
fr: Champs VOTable par défaut à supprimer (ex : 'coo_bibcode'). Peut être spécifié plusieurs fois.Champs VOTable par défaut à supprimer (par exemple, 'coo_bibcode'). Peut être spécifié plusieurs fois.
ja: 削除するデフォルトのVOTableフィールド（例：'coo_bibcode'）。複数回指定できます。削除するデフォルトのVOTableフィールド (例: 'coo_bibcode')。複数指定可能です。

source: Automatically include a set of common useful fields.
fr: Inclure automatiquement un ensemble de champs utiles courants.
ja: 一般的な有用なフィールドのセットを自動的に含めます。

source: [cyan]Querying SIMBAD for object: '{object_name}'...[/cyan]
fr: [cyan]Interrogation de SIMBAD pour l'objet : ''...[/cyan]
ja: [cyan]SIMBADでオブジェクト '' をクエリ中...[/cyan]

source: SIMBAD Data for {object_name}
fr: Données SIMBAD pour
ja: のSIMBADデータ

source: SIMBAD object query
fr: Requête objet SIMBAD
ja: SIMBADオブジェクトクエリ

source: SIMBAD object
fr: Objet SIMBAD
ja: SIMBADオブジェクト

source: Query all identifiers for an astronomical object.
fr: Interroger tous les identifiants d'un objet astronomique.
ja: 天体のすべての識別子をクエリします。

source: Name of the object (e.g., 'Polaris').
fr: Nom de l'objet (ex : 'Polaris').
ja: 天体名（例：'Polaris'）。

source: [cyan]Querying SIMBAD for identifiers of: '{object_name}'...[/cyan]
fr: [cyan]Interrogation de SIMBAD pour les identifiants de : ''...[/cyan][cyan]Interrogation de SIMBAD pour les identifiants de : '{object_name}'...[/cyan]
ja: [cyan]SIMBADで '' の識別子をクエリ中...[/cyan]

source: SIMBAD Identifiers for {object_name}
fr: Identifiants SIMBAD pour
ja: のSIMBAD識別子

source: SIMBAD ID query
fr: Requête ID SIMBAD
ja: SIMBAD IDクエリ

source: [yellow]No identifiers found for object '{object_name}'.[/yellow]
fr: [yellow]Aucun identifiant trouvé pour l'objet ''.[/yellow][yellow]Aucun identifiant trouvé pour l'objet '{object_name}'.[/yellow]
ja: [yellow]オブジェクト '' の識別子が見つかりませんでした。[/yellow]

source: SIMBAD ids
fr: IDs SIMBAD
ja: SIMBAD ID

source: Query objects associated with a bibcode or bibcode list.
fr: Interroger les objets associés à un bibcode ou à une liste de bibcodes.
ja: bibcodeまたはbibcodeリストに関連付けられたオブジェクトをクエリします。

source: Bibcode(s) to query (e.g., '2003A&A...409..581H'). Can specify multiple.
fr: Bibcode(s) à interroger (ex : '2003A&A...409..581H'). Peut spécifier plusieurs.Bibcode(s) à interroger (par exemple, '2003A&A...409..581H'). Peut spécifier plusieurs.
ja: クエリするBibcode（複数可）（例：'2003A&A...409..581H'）。複数指定できます。

source: [cyan]Querying SIMBAD for objects in bibcode(s): {bibcodes_list}...[/cyan]
fr: [cyan]Interrogation de SIMBAD pour les objets dans les bibcode(s) : ...[/cyan][cyan]Interrogation de SIMBAD pour les objets dans le(s) bibcode(s) : {bibcodes_list}...[/cyan]
ja: [cyan]SIMBADでbibcode(s)内のオブジェクトをクエリ中：...[/cyan]

source: SIMBAD Objects for Bibcode(s)
fr: Objets SIMBAD pour les bibcode(s)
ja: BibcodeのSIMBADオブジェクト

source: SIMBAD bibcode query
fr: Requête bibcode SIMBAD
ja: SIMBAD Bibcodeクエリ

source: [yellow]No objects found for the given bibcode(s).[/yellow]
fr: [yellow]Aucun objet trouvé pour le(s) bibcode(s) donné(s).[/yellow]
ja: [yellow]指定されたbibcode(s)のオブジェクトは見つかりませんでした。[/yellow][yellow]指定されたbibcodeに一致する天体は見つかりませんでした。[/yellow]

source: SIMBAD bibcode
fr: Bibcode SIMBAD

source: Query the Splatalogue spectral line database.
fr: Interroger la base de données des raies spectrales Splatalogue.
ja: Splatalogueスペクトル線データベースをクエリします。

source: [red]Error: Wavelength range '{range_str}' must be in 'min-max' format (e.g., '100um-200um').[/red]
fr: [red]Erreur : La plage de longueurs d'onde '' doit être au format 'min-max' (ex : '100um-200um').[/red][red]Erreur : La plage de fréquences '{freq_str}' doit être au format 'min-max' (par exemple, '100GHz-110GHz').[/red]
ja: [red]エラー：波長範囲 '' は 'min-max' 形式（例：'100um-200um'）である必要があります。[/red][red]エラー: 周波数範囲 '{freq_str}' は '最小値-最大値' 形式である必要があります (例: '100GHz-110GHz')。[/red]

source: [red]Error: Frequency range '{range_str}' must be in 'min-max' format (e.g., '100GHz-110GHz').[/red]
fr: [red]Erreur : La plage de fréquences '' doit être au format 'min-max' (ex : '100GHz-110GHz').[/red][red]Erreur : La plage de fréquences '{freq_str}' doit être au format 'min-max' (par exemple, '100GHz-110GHz').[/red]
ja: [red]エラー：周波数範囲 '' は 'min-max' 形式（例：'100GHz-110GHz'）である必要があります。[/red][red]エラー: 周波数範囲 '{freq_str}' は '最小値-最大値' 形式である必要があります (例: '100GHz-110GHz')。[/red]

source: [red]Error: Wavelengths must have units of length (e.g., um, nm, mm).[/red]
fr: [red]Erreur : Les longueurs d'onde doivent avoir des unités de longueur (ex : um, nm, mm).[/red][red]Erreur : Les fréquences doivent avoir des unités de fréquence (par exemple, GHz, MHz).[/red]
ja: [red]エラー：波長には長さの単位（例：um, nm, mm）が必要です。[/red]

source: [red]Error: Frequencies must have units of frequency (e.g., GHz, MHz).[/red]
fr: [red]Erreur : Les fréquences doivent avoir des unités de fréquence (ex : GHz, MHz).[/red][red]Erreur : Les fréquences doivent avoir des unités de fréquence (par exemple, GHz, MHz).[/red]
ja: [red]エラー：周波数には周波数単位（例：GHz、MHz）が必要です。[/red]

source: [red]Error parsing {unit_type} range '{range_str}': {error_message}[/red]
fr: [bold red]Erreur lors de l'analyse de la plage '' : [/bold red][red]Erreur lors de l'analyse de la plage de fréquences '{freq_str}' : {error_message}[/red]
ja: [red] 範囲 '' の解析エラー：[/red]

source: Query spectral lines from Splatalogue by chemical name. Optionally filter by wavelength (-w) or frequency (-f) range.
fr: Interroger les raies spectrales de Splatalogue par nom chimique. Filtrer optionnellement par plage de longueurs d'onde (-w) ou de fréquences (-f).Interroger les raies spectrales de Splatalogue par nom chimique. Filtrer optionnellement par plage de longueur d'onde (-w) ou de fréquence (-f).
ja: Splatalogueから化学名でスペクトル線をクエリします。オプションで波長（-w）または周波数（-f）範囲でフィルタリングできます。Splatalogueから化学名でスペクトル線を照会します。オプションで波長 (-w) または周波数 (-f) の範囲でフィルターできます。

source: Chemical name pattern (e.g., 'CO', '%H2O%').
fr: Nom de la source ou modèle (par exemple, 'Gaia DR3', '2MASS').
ja: ソース名またはパターン (例: 'Gaia DR3', '2MASS')。

source: You can use cent for SQL-like wildcards:
fr: Vous pouvez utiliser cent pour les caractères génériques de type SQL :
ja: SQLライクなワイルドカードに パーセント を使用できます：

source: '%CO%' matches any containing CO,
fr: '%CO%' correspond à tout ce qui contient CO,
ja: '%CO%'はCOを含む任意のものに一致し、

source: 'CO%' matches starting with CO,
fr: 'CO%' correspond à ce qui commence par CO,
ja: 'CO%'はCOで始まるものに一致し、

source: '%CO' matches matches ending with CO.
fr: '%CO' correspond à ce qui se termine par CO.
ja: '%CO'はCOで終わるものに一致します。

source: Wavelength range (e.g., '100um-200um'). You can directly input this as the second argument without -w. Mutually exclusive with frequency_range.
fr: Gamme de longueurs d'onde (ex : '100um-200um'). Vous pouvez directement l'entrer comme deuxième argument sans -w. Mutuellement exclusif avec frequency_range.Plage de longueurs d'onde (par exemple, '100um-200um'). Vous pouvez l'entrer directement comme deuxième argument sans -w. Mutuellement exclusif avec la plage de fréquences.
ja: 波長範囲（例：'100um-200um'）。-wなしで2番目の引数として直接入力できます。frequency_rangeとは排他的です。波長範囲（例: '100um-200um'）。これを-wなしで2番目の引数として直接入力できます。周波数範囲とは排他的です。

source: Frequency range (e.g., '100GHz-110GHz'). You can directly input this as the second argument without -f. Mutually exclusive with wavelength_range.
fr: Gamme de fréquences (ex : '100GHz-110GHz'). Vous pouvez directement l'entrer comme deuxième argument sans -f. Mutuellement exclusif avec wavelength_range.Plage de fréquences (par exemple, '100GHz-110GHz'). Vous pouvez l'entrer directement comme deuxième argument sans -f. Mutuellement exclusif avec la plage de longueurs d'onde.
ja: 周波数範囲（例：'100GHz-110GHz'）。-fなしで2番目の引数として直接入力できます。wavelength_rangeとは排他的です。周波数範囲（例: '100GHz-110GHz'）。これを-fなしで2番目の引数として直接入力できます。波長範囲とは排他的です。

source: Maximum energy in K (E_upper).
fr: Énergie maximale en K (E_supérieure).
ja: K単位の最大エネルギー（E_upper）。

source: Energy type ('el' or 'eu' for E_lower or E_upper).
fr: Type d'énergie ('el' ou 'eu' pour E_inférieure ou E_supérieure).
ja: エネルギータイプ（E_lowerの場合は'el'、E_upperの場合は'eu'）。

source: Line strength units (e.g., 'ls1', 'ls2', 'ls4', 'ls5' for CDMS/JPL or TopModel).
fr: Unités d'intensité de raie (ex : 'ls1', 'ls2', 'ls4', 'ls5' pour CDMS/JPL ou TopModel).Unités de force de ligne (par exemple, 'ls1', 'ls2', 'ls4', 'ls5' pour CDMS/JPL ou TopModel).
ja: 線強度単位（例：CDMS/JPLまたはTopModelの'ls1', 'ls2', 'ls4', 'ls5'）。線強度単位 (例: CDMS/JPL または TopModel の場合は 'ls1', 'ls2', 'ls4', 'ls5')。

source: Species to exclude (e.g., 'HDO').
fr: Espèces à exclure (ex : 'HDO').
ja: 除外する種（例：'HDO'）。

source: Astropy table format for saving (e.g. 'csv', 'ecsv', 'fits', 'votable'). Overrides file extension inference.
fr: Format de table Astropy pour la sauvegarde (ex : 'csv', 'ecsv', 'fits', 'votable'). Annule l'inférence de l'extension de fichier.Format de table Astropy pour l'enregistrement (par exemple, 'csv', 'ecsv', 'fits', 'votable'). Annule l'inférence à partir de l'extension du nom de fichier.
ja: 保存するAstropyテーブル形式（例：'csv', 'ecsv', 'fits', 'votable'）。ファイル拡張子の推論を上書きします。保存するためのAstropyテーブル形式（例：'csv'、'ecsv'、'fits'、'votable'）。ファイル拡張子からの推論を上書きします。

source: [red]You cannot specify both -w/--wavelength-range and -f/--frequency-range.[/red]
fr: [red]Vous ne pouvez pas spécifier à la fois -w/--wavelength-range et -f/--frequency-range.[/red][red]Vous ne pouvez pas spécifier à la fois -w/--wavelength-range et -f/--frequency-range.[/red]
ja: [red]-w/--wavelength-range と -f/--frequency-range を両方指定することはできません。[/red][red]-w/--wavelength-range と -f/--frequency-range の両方を指定することはできません。[/red]

source: [cyan]Querying Splatalogue for '{chemical_name}' in frequency range '{frequency_range}'...[/cyan]
fr: [cyan]Interrogation de Splatalogue pour '' dans la plage de fréquences ''...[/cyan][cyan]Interrogation de Splatalogue pour les raies dans la plage '{frequency_range}'...[/cyan]
ja: [cyan]Splatalogueで '' を周波数範囲 '' でクエリ中...[/cyan][cyan]周波数範囲 '{frequency_range}' のスペクトル線をSplatalogueで照会中...[/cyan]

source: [red]Error: You must specify a wavelength or frequency range as the second argument (e.g., '100um-200um' or '100GHz-110GHz'). No -w or -f flag is needed; just provide the range directly.[/red]
fr: [red]Erreur : Vous devez spécifier une plage de longueurs d'onde ou de fréquences comme deuxième argument (ex : '100um-200um' ou '100GHz-110GHz'). Aucun drapeau -w ou -f n'est nécessaire ; il suffit de fournir la plage directement.[/red][red]Erreur : Vous devez spécifier une plage de longueurs d'onde ou de fréquences comme deuxième argument (par exemple, '100um-200um' ou '100GHz-110GHz'). Aucun drapeau -w ou -f n'est nécessaire ; il suffit de fournir la plage directement.[/red]
ja: [red]エラー：2番目の引数として波長または周波数範囲を指定する必要があります（例：'100um-200um' または '100GHz-110GHz'）。-w または -f フラグは不要です。直接範囲を指定してください。[/red][red]エラー: 2番目の引数として波長または周波数範囲を指定する必要があります（例: '100um-200um' または '100GHz-110GHz'）。-w または -f フラグは不要です。範囲を直接提供してください。[/red]

source: [green]Found {count} spectral line(s).[/green]
fr: [green]Trouvé raie(s) spectrale(s).[/green]
ja: [green] 件のスペクトル線が見つかりました。[/green]

source: Splatalogue Lines
fr: Raies Splatalogue
ja: Splatalogueライン

source: Splatalogue line query
fr: Requête de raie Splatalogue
ja: Splatalogueラインクエリ

source: [yellow]No spectral lines found for the given criteria.[/yellow]
fr: [yellow]Aucune raie spectrale trouvée pour les critères donnés.[/yellow][yellow]Aucune raie spectrale trouvée pour les critères donnés.[/yellow]
ja: [yellow]指定された条件のスペクトル線は見つかりませんでした。[/yellow][yellow]指定された基準に一致するスペクトル線は見つかりませんでした。[/yellow]
