Repository: inoribea/astroquery-cli
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr, ja

source: [yellow]Please provide at least --constraint(s) or --keyword(s) for this query type.[/yellow]
fr: [yellow]Veuillez fournir au moins --constraint(s) ou --keyword(s) pour ce type de requête.[/yellow][yellow]Veuillez fournir au moins --constraint(s) ou --keyword(s) pour ce type de requête.[/yellow]
ja: [yellow]このクエリタイプには、少なくとも --constraint(s) または --keyword(s) を指定してください。[/yellow][yellow]この照会タイプには、少なくとも --constraint(s) または --keyword(s) を指定してください。[/yellow]

source: keywords
fr: mots-clés
ja: キーワード

source: Vizier constraints
fr: Contraintes Vizier
ja: VizieR制約

source: {ms_value} ms
fr: ms
ja: ms

source: No time found
fr: Aucun temps trouvé
ja: 時間が見つかりません

source: ICMP disabled or blocked
fr: ICMP désactivé ou bloqué
ja: ICMPが無効またはブロックされています

source: Ping error: {error_message}
fr: Erreur de ping :
ja: Pingエラー：

source: Checking service availability...
fr: Vérification de la disponibilité du service...
ja: サービス可用性を確認中...

source: Unknown
fr: Inconnu
ja: 不明

source: Resolved to {ip_address}
fr: Résolu en
ja: に解決されました

source: DNS resolution failed: {error_message}
fr: Échec de la résolution DNS :
ja: DNS解決に失敗しました：

source: Service Unavailable
fr: Service indisponible
ja: サービス利用不可

source: HTTP Status: {status_code}
fr: Statut HTTP :
ja: HTTPステータス：

source: Service Available
fr: Service disponible
ja: サービス利用可能

source: Service Responded with Error ({status_code})
fr: Le service a répondu avec une erreur ()
ja: サービスがエラーで応答しました（）

source: HTTP Request Failed: {error_message}
fr: Échec de la requête HTTP :
ja: HTTPリクエスト失敗：

source: Service Unavailable (Connection Error)
fr: Service indisponible (erreur de connexion)
ja: サービス利用不可（接続エラー）

source: Availability: {availability_message}
fr: Disponibilité: {availability_message}
ja: 可用性: {availability_message}

source: DNS Status: {dns_status}
fr: Statut DNS: {dns_status}
ja: DNSステータス: {dns_status}

source: Ping Status: {ping_status}
fr: Statut Ping: {ping_status}
ja: Pingステータス: {ping_status}

source: HTTP Status: {http_status}
fr: Statut HTTP: {http_status}
ja: HTTPステータス: {http_status}
