Repository: inoribea/astroquery-cli
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr, ja

source: [yellow]No matching chemical species found. Please check your chemical_name pattern and try removing wildcards or using a more specific name.[/yellow]
fr: [yellow]Aucune espèce chimique correspondante trouvée. Veuillez vérifier votre motif chemical_name et essayez de supprimer les jokers ou d'utiliser un nom plus spécifique.[/yellow][yellow]Aucune espèce chimique correspondante trouvée. Veuillez vérifier votre modèle de nom chimique et essayer de supprimer les caractères génériques ou d'utiliser un nom plus spécifique.[/yellow]
ja: [yellow]一致する化学種が見つかりませんでした。chemical_nameパターンを確認し、ワイルドカードを削除するか、より具体的な名前を使用してみてください。[/yellow][yellow]一致する化学種が見つかりませんでした。chemical_name パターンを確認し、ワイルドカードを削除するか、より具体的な名前を使用してみてください。[/yellow]

source: Splatalogue lines
fr: Raies Splatalogue
ja: Splatalogueライン

source: Get the table of NRAO recommended species.
fr: Obtenir la table des espèces recommandées par le NRAO.
ja: NRAO推奨種テーブルを取得します。

source: [cyan]Fetching NRAO recommended species table from Splatalogue...[/cyan]
fr: [cyan]Récupération de la table des espèces recommandées par le NRAO depuis Splatalogue...[/cyan][cyan]Récupération de la table des espèces recommandées par le NRAO à partir de Splatalogue...[/cyan]
ja: [cyan]SplatalogueからNRAO推奨種テーブルを取得中...[/cyan]

source: Splatalogue NRAO Recommended Species
fr: Espèces recommandées par le NRAO dans Splatalogue
ja: Splatalogue NRAO推奨種

source: Splatalogue species table
fr: Table des espèces Splatalogue
ja: Splatalogue種テーブル

source: [yellow]Could not retrieve species table or it is empty.[/yellow]
fr: [yellow]Impossible de récupérer la table des espèces ou elle est vide.[/yellow][yellow]Impossible de récupérer la table des espèces ou celle-ci est vide.[/yellow]
ja: [yellow]種テーブルを取得できませんでした、または空です。[/yellow]

source: Splatalogue species-table
fr: Table des espèces Splatalogue
ja: Splatalogue種テーブル

source: Query the VizieR astronomical catalog service.
fr: Interroger le service de catalogues astronomiques VizieR.
ja: VizieR天文カタログサービスをクエリします。

source: [bold red]Error parsing angle string '{angle_str}': {error_message}[/bold red]
fr: [bold red]Erreur lors de l'analyse de la chaîne d'angle '' : [/bold red][bold red]Erreur lors de l'analyse de la chaîne d'angle '{angle_str}' : {error_message}[/bold red]
ja: [bold red]角度文字列''の解析エラー：[/bold red][bold red]角度文字列 '{angle_str}' の解析エラー: {error_message}[/bold red]

source: [yellow]Hint: Use format like '5arcmin', '0.5deg', '10arcsec'.[/yellow]
fr: [yellow]Conseil : Utilisez un format comme '5arcmin', '0.5deg', '10arcsec'.[/yellow][yellow]Indice : Utilisez un format comme '5arcmin', '0.5deg', '10arcsec'.[/yellow]
ja: [yellow]ヒント：'5arcmin'、'0.5deg'、'10arcsec'のような形式を使用してください。[/yellow][yellow]ヒント: '5arcmin', '0.5deg', '10arcsec' のような形式を使用してください。[/yellow]

source: [bold red]Error parsing coordinates '{coords_str}': {error_message}[/bold red]
fr: [bold red]Erreur lors de l'analyse des coordonnées '' : [/bold red][bold red]Erreur lors de l'analyse des coordonnées '{coords_str}' : {error_message}[/bold red]
ja: [bold red]座標''の解析エラー：[/bold red]

source: [yellow]Hint: Try 'M31', '10.68h +41.26d', or '160.32 41.45'.[/yellow]
fr: [yellow]Conseil : Essayez 'M31', '10.68h +41.26d', ou '160.32 41.45'.[/yellow][yellow]Indice : Essayez 'M31', '10.68h +41.26d', ou '160.32 41.45'.[/yellow]
ja: [yellow]ヒント：'M31'、'10.68h +41.26d'、または '160.32 41.45' を試してください。[/yellow][yellow]ヒント: 'M31', '10.68h +41.26d', または '160.32 41.45' を試してください。[/yellow]

source: [bold red]Invalid constraint format: '{item}'. Expected 'column=condition'.[/bold red]
fr: [bold red]Format de contrainte invalide : ''. Attendu 'colonne=condition'.[/bold red][bold red]Format de contrainte invalide : '{item}'. Attendu 'colonne=condition'.[/bold red]
ja: [bold red]無効な制約形式：''。'column=condition'の形式が期待されます。[/bold red][bold red]無効な制約形式: '{item}'。'column=condition' が期待されます。[/bold red]

source: Find VizieR catalogs based on keywords, UCDs, or source names.
fr: Rechercher des catalogues VizieR basés sur des mots-clés, des UCDs ou des noms de sources.Rechercher des catalogues VizieR basés sur des mots-clés, des UCD ou des noms de source.
ja: キーワード、UCD、またはソース名に基づいてVizieRカタログを検索します。

source: Keyword(s) to search for in catalog descriptions.
fr: Mot(s)-clé(s) à rechercher dans les descriptions de catalogue.
ja: カタログの説明で検索するキーワード。

source: UCD (Unified Content Descriptor) to filter catalogs.
fr: UCD (Unified Content Descriptor) pour filtrer les catalogues.
ja: カタログをフィルタリングするためのUCD（統一コンテンツ記述子）。

source: Source name or pattern (e.g., 'Gaia DR3', '2MASS').
fr: Nom ou motif de la source (ex : 'Gaia DR3', '2MASS').
ja: ソース名またはパターン（例：'Gaia DR3', '2MASS'）。

source: Maximum number of catalogs to list.
fr: Nombre maximal de catalogues à lister.
ja: リストするカタログの最大数。

source: VizieR server to use. Choices: {server_list}
fr: Serveur VizieR à utiliser. Choix :
ja: 使用するVizieRサーバー。選択肢：

source: [cyan]Searching for VizieR catalogs...[/cyan]
fr: [cyan]Recherche de catalogues VizieR...[/cyan]
ja: [cyan]VizieRカタログを検索中...[/cyan]

source: Using VizieR server: {server_url}
fr: Utilisation du serveur VizieR : {server_url}
ja: VizieRサーバーを使用中：{server_url}

source: Keywords: {keywords_list}
fr: Mots-clés :
ja: キーワード：

source: UCD: {ucd_val}
fr: UCD :
ja: UCD:

source: Source Name: {source_val}
fr: Nom de la source :
ja: ソース名：

source: [yellow]Please provide at least one search criterion (keyword, ucd, or source name).[/yellow]
fr: [yellow]Veuillez fournir au moins un critère de recherche (mot-clé, UCD ou nom de source).[/yellow][yellow]Veuillez fournir au moins un critère de recherche (mot-clé, UCD ou nom de source).[/yellow]
ja: [yellow]少なくとも1つの検索条件（キーワード、UCD、またはソース名）を指定してください。[/yellow][yellow]少なくとも1つの検索基準 (キーワード、UCD、またはソース名) を指定してください。[/yellow]

source: Example: `aqc vizier find-catalogs --keyword photometry --keyword M31`
fr: Exemple : `aqc vizier find-catalogs --keyword photometry --keyword M31`Exemple : `aqc vizier find-catalogs --keyword photométrie --keyword M31`
ja: 例: `aqc vizier find-catalogs --keyword photometry --keyword M31`

source: Found VizieR Catalogs
fr: Catalogues VizieR trouvés
ja: 見つかったVizieRカタログ

source: [yellow]No catalogs found matching your criteria.[/yellow]
fr: [yellow]Aucun catalogue trouvé correspondant à vos critères.[/yellow]
ja: [yellow]条件に一致するカタログは見つかりませんでした。[/yellow]

source: VizieR find_catalogs
fr: VizieR trouver les catalogues

source: List all available VizieR catalogs. Note: VizieR API does not support listing all catalogs at once. If no catalogs are found, try 'find-catalogs' with keywords. Common keywords: 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'. Example: aqc vizier find-catalogs --keyword photometry --keyword galaxy
fr: Lister tous les catalogues VizieR disponibles. Note : l'API VizieR ne prend pas en charge la liste de tous les catalogues en une seule fois. Si aucun catalogue n'est trouvé, essayez 'find-catalogs' avec des mots-clés. Mots-clés courants : 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'. Exemple : aqc vizier find-catalogs --keyword photometry --keyword galaxyLister tous les catalogues VizieR disponibles. Remarque : L'API VizieR ne prend pas en charge la liste de tous les catalogues en une seule fois. Si aucun catalogue n'est trouvé, essayez 'find-catalogs' avec des mots-clés. Mots-clés courants : 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'. Exemple : aqc vizier find-catalogs --keyword photometry --keyword galaxy
ja: 利用可能なすべてのVizieRカタログをリスト表示します。注：VizieR APIはすべてのカタログを一度にリスト表示することをサポートしていません。カタログが見つからない場合は、キーワードで'find-catalogs'を試してください。一般的なキーワード：'photometry'（測光）、'galaxy'（銀河）、'quasar'（クエーサー）、'gaia'（ガイア）、'2mass'（2MASS）、'sdss'（SDSS）、'star'（星）、'cluster'（星団）、'radio'（電波）、'infrared'（赤外線）、'xray'（X線）、'survey'（サーベイ）、'variable'（変光星）、'proper motion'（固有運動）、'catalog'（カタログ）。例：aqc vizier find-catalogs --keyword photometry --keyword galaxy利用可能なすべてのVizieRカタログを一覧表示します。注：VizieR APIは、すべてのカタログを一度に一覧表示することをサポートしていません。カタログが見つからない場合は、キーワード付きで「find-catalogs」を試してください。一般的なキーワード： 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.例：aqc vizier find-catalogs --keyword photometry --keyword galaxy

source: [cyan]Attempting to list all VizieR catalogs...[/cyan]
fr: [cyan]Tentative de lister tous les catalogues VizieR...[/cyan]
ja: [cyan]すべてのVizieRカタログをリストしようとしています...[/cyan]

source: [yellow]Note: If this returns no catalogs, the VizieR service might not support listing all catalogs directly, or there might be a network issue. Consider using 'find-catalogs' with specific keywords instead.[/yellow]
fr: [yellow]Note : Si cela ne retourne aucun catalogue, le service VizieR pourrait ne pas prendre en charge la liste directe de tous les catalogues, ou il pourrait y avoir un problème de réseau. Envisagez d'utiliser 'find-catalogs' avec des mots-clés spécifiques à la place.[/yellow][yellow]Note : Si cela ne renvoie aucun catalogue, le service VizieR pourrait ne pas prendre en charge la liste directe de tous les catalogues, ou il pourrait y avoir un problème de réseau. Envisagez d'utiliser 'find-catalogs' avec des mots-clés spécifiques à la place.[/yellow]
ja: [yellow]注：これによりカタログが返されない場合、VizieRサービスがすべてのカタログを直接リスト表示することをサポートしていないか、ネットワークの問題がある可能性があります。代わりに特定のキーワードを使用して 'find-catalogs' を検討してください。[/yellow][yellow]注意：これがカタログを返さない場合、VizieRサービスがすべてのカタログを直接一覧表示することをサポートしていないか、ネットワークの問題が発生している可能性があります。代わりに特定のキーワードを使用して「find-catalogs」を検討してください。[/yellow]

source: All Available VizieR Catalogs
fr: Tous les catalogues VizieR disponibles
ja: 利用可能なすべてのVizieRカタログ

source: [yellow]No catalogs found using direct listing. VizieR API does not support listing all catalogs at once. Please use keyword search. Common keywords: 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow]
fr: [yellow]Aucun catalogue trouvé par liste directe. L'API VizieR ne prend pas en charge la liste de tous les catalogues en une seule fois. Veuillez utiliser la recherche par mots-clés. Mots-clés courants : 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow][yellow]Aucun catalogue trouvé par liste directe. L'API VizieR ne prend pas en charge la liste de tous les catalogues en une seule fois. Veuillez utiliser la recherche par mots-clés. Mots-clés courants : 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow]
ja: [yellow]直接リスト表示ではカタログが見つかりませんでした。VizieR APIは一度にすべてのカタログをリスト表示することをサポートしていません。キーワード検索を使用してください。一般的なキーワード：'photometry'（測光）、'galaxy'（銀河）、'quasar'（クエーサー）、'gaia'（ガイア）、'2mass'（2MASS）、'sdss'（SDSS）、'star'（星）、'cluster'（星団）、'radio'（電波）、'infrared'（赤外線）、'xray'（X線）、'survey'（サーベイ）、'variable'（変光星）、'proper motion'（固有運動）、'catalog'（カタログ）。[/yellow][yellow]直接リストアップではカタログが見つかりませんでした。VizieR APIはすべてのカタログを一度にリストアップする機能をサポートしていません。キーワード検索をご利用ください。一般的なキーワード： 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow]

source: [yellow]Example: aqc vizier find-catalogs --keyword photometry --keyword galaxy[/yellow]
fr: [yellow]Exemple : aqc vizier find-catalogs --keyword photometry --keyword galaxy[/yellow]Exemple : `aqc vizier find-catalogs --keyword photométrie --keyword M31`
ja: [yellow]例：aqc vizier find-catalogs --keyword photometry --keyword galaxy[/yellow]

source: VizieR list_catalogs
fr: VizieR lister les catalogues

source: [yellow]VizieR API does not support listing all catalogs at once. Please use keyword search. Common keywords: 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow]
fr: [yellow]L'API VizieR ne prend pas en charge la liste de tous les catalogues en une seule fois. Veuillez utiliser la recherche par mots-clés. Mots-clés courants : 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow][yellow]L'API VizieR ne prend pas en charge la liste de tous les catalogues en une seule fois. Veuillez utiliser la recherche par mots-clés. Mots-clés courants : 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow]
ja: [yellow]VizieR APIは一度にすべてのカタログをリスト表示することをサポートしていません。キーワード検索を使用してください。一般的なキーワード：'photometry'（測光）、'galaxy'（銀河）、'quasar'（クエーサー）、'gaia'（ガイア）、'2mass'（2MASS）、'sdss'（SDSS）、'star'（星）、'cluster'（星団）、'radio'（電波）、'infrared'（赤外線）、'xray'（X線）、'survey'（サーベイ）、'variable'（変光星）、'proper motion'（固有運動）、'catalog'（カタログ）。[/yellow][yellow]VizieR APIは、すべてのカタログを一度にリストアップすることをサポートしていません。キーワード検索をご利用ください。一般的なキーワード： 'photometry', 'galaxy', 'quasar', 'gaia', '2mass', 'sdss', 'star', 'cluster', 'radio', 'infrared', 'xray', 'survey', 'variable', 'proper motion', 'catalog'.[/yellow]

source: Query catalogs around an object name or specific coordinates.
fr: Interroger les catalogues autour d'un nom d'objet ou de coordonnées spécifiques.Interroger les catalogues autour d'un nom d'objet ou de coordonnées spécifiques.
ja: 天体名または特定の座標の周りのカタログをクエリします。

source: Object name (e.g., 'M31') or coordinates (e.g., '10.68h +41.26d' or '160.32 41.45').
fr: Nom de l'objet (ex : 'M31') ou coordonnées (ex : '10.68h +41.26d' ou '160.32 41.45').Nom de l'objet (par exemple, 'M31') ou coordonnées (par exemple, '10.68h +41.26d' ou '160.32 41.45').
ja: 天体名（例：'M31'）または座標（例：'10.68h +41.26d' または '160.32 41.45'）。天体名 (例: 'M31') または座標 (例: '10.68h +41.26d' または '160.32 41.45')。

source: Search radius (e.g., '5arcmin', '0.1deg'). Can be specified as positional argument or with -r/--radius.
fr: Rayon de recherche (ex : '5arcmin', '0.1deg'). Peut être spécifié comme argument positionnel ou avec -r/--radius.Rayon de recherche conique (par exemple, '5arcmin', '0.1deg'). À utiliser si la largeur/hauteur n'est pas spécifiée.
ja: 検索半径（例：'5arcmin', '0.1deg'）。位置引数として、または-r/--radiusで指定できます。コーンサーチ半径 (例: '5arcmin', '0.1deg')。幅/高さを指定しない場合に使用します。

source: VizieR catalog identifier(s) (e.g., 'I/261/gaiadr3', 'J/ApJ/710/1776'). Can be specified multiple times. Default: 'I/261/gaiadr3'
fr: Identifiant(s) de catalogue VizieR (ex : 'I/261/gaiadr3', 'J/ApJ/710/1776'). Peut être spécifié plusieurs fois. Par défaut : 'I/261/gaiadr3'Identifiant(s) de catalogue VizieR (par exemple, 'I/261/gaiadr3', 'J/ApJ/710/1776'). Peut être spécifié plusieurs fois.
ja: VizieRカタログ識別子（複数可）（例：'I/261/gaiadr3', 'J/ApJ/710/1776'）。複数回指定できます。デフォルト：'I/261/gaiadr3'VizieR カタログ識別子 (例: 'I/261/gaiadr3', 'J/ApJ/710/1776')。複数指定可能です。

source: Specific columns to retrieve (e.g., 'RAJ2000', 'DEJ2000', 'pmRA'). Use 'all' for all columns. Can be specified multiple times.
fr: Colonnes spécifiques à récupérer (ex : 'RAJ2000', 'DEJ2000', 'pmRA'). Utilisez 'all' pour toutes les colonnes. Peut être spécifié plusieurs fois.Colonnes spécifiques à récupérer (par exemple, 'RAJ2000', 'DEJ2000', 'pmRA'). Utilisez 'all' pour toutes les colonnes. Peut être spécifié plusieurs fois.
ja: 取得する特定の列（例：'RAJ2000', 'DEJ2000', 'pmRA'）。すべての列については'all'を使用します。複数回指定できます。取得する特定の列 (例: 'RAJ2000' (J2000赤経), 'DEJ2000' (J2000赤緯), 'pmRA' (赤経方向の固有運動))。すべての列を取得するには 'all' を使用します。複数指定可能です。

source: Column filters (e.g., 'Imag<15', 'B-V>0.5'). Can be specified multiple times. Format: 'column_name<operator>value'.
fr: Filtres de colonne (ex : 'Imag<15', 'B-V>0.5'). Peut être spécifié plusieurs fois. Format : 'nom_colonne<opérateur>valeur'.Filtres de colonnes (par exemple, 'Imag<15', 'B-V>0.5'). Peuvent être spécifiés plusieurs fois. Format : 'nom_colonne<opérateur>valeur'.
ja: 列フィルター（例：'Imag<15', 'B-V>0.5'）。複数回指定できます。形式：'column_name<operator>value'。列フィルター (例: 'Imag<15', 'B-V>0.5')。複数指定可能です。形式: 'column_name<operator>value'。

source: Maximum number of rows to return per catalog.
fr: Nombre maximal de lignes à retourner par catalogue.
ja: カタログごとに返される最大行数。

source: Maximum number of rows to display per table. Use -1 for all rows.
fr: Nombre maximal de lignes à afficher par table. Utilisez -1 pour toutes les lignes.Nombre maximum de lignes à afficher par table. Utilisez -1 pour toutes les lignes.
ja: テーブルごとに表示する最大行数。すべての行を表示するには-1を使用します。テーブルごとに表示する最大行数。すべての行を表示するには -1 を使用します。

source: [cyan]Querying VizieR for object '{target_name}' in catalog(s): {catalog_list}...[/cyan]
fr: [cyan]Interrogation de VizieR pour l'objet '' dans le(s) catalogue(s) : ...[/cyan][cyan]Interrogation de VizieR pour l'objet '{target_name}' dans le(s) catalogue(s) : {catalog_list}...[/cyan]
ja: [cyan]VizieRでオブジェクト '' をカタログ '' でクエリ中...[/cyan][cyan]天体 '{target_name}' のデータをカタログ {catalog_list} でVizieR照会中...[/cyan]

source: Using VizieR server: {server_url}, Row limit: {limit}
fr: Utilisation du serveur VizieR : , Limite de lignes :
ja: VizieRサーバーを使用中：、行制限：

source: [yellow]No results returned from VizieR for this query.[/yellow]
fr: [yellow]Aucun résultat retourné par VizieR pour cette requête.[/yellow]
ja: [yellow]このクエリに対してVizieRから結果は返されませんでした。[/yellow]

source: Results from {catalog_name} for {target_name}
fr: Résultats de pour
ja: の からの結果

source: [yellow]No data found in catalog '{catalog_name}' for the given criteria.[/yellow]
fr: [yellow]Aucune donnée trouvée dans le catalogue '' pour les critères donnés.[/yellow][yellow]Aucune donnée trouvée dans le catalogue '{catalog_name}' pour les critères donnés.[/yellow]
ja: [yellow]カタログ '' で指定された条件のデータは見つかりませんでした。[/yellow][yellow]カタログ '{catalog_name}' に指定された基準のデータは見つかりませんでした。[/yellow]

source: Vizier object
fr: Objet Vizier
ja: VizieRオブジェクト

source: Query catalogs within a sky region (cone or box).
fr: Interroger les catalogues dans une région du ciel (cône ou boîte).
ja: 空の領域（コーンまたはボックス）内のカタログをクエリします。

source: Central coordinates for the region (e.g., '10.68h +41.26d' or '160.32 41.45').
fr: Coordonnées centrales pour la région (ex : '10.68h +41.26d' ou '160.32 41.45').Coordonnées centrales pour la région (par exemple, '10.68h +41.26d' ou '160.32 41.45').
ja: 領域の中心座標（例：'10.68h +41.26d' または '160.32 41.45'）。

source: Cone search radius (e.g., '5arcmin', '0.1deg'). Use if not specifying width/height. Can be specified as positional argument or with -r/--radius.
fr: Rayon de recherche conique (ex : '5arcmin', '0.1deg'). À utiliser si la largeur/hauteur n'est pas spécifiée. Peut être spécifié comme argument positionnel ou avec -r/--radius.Rayon de recherche conique (par exemple, '5arcmin', '0.1deg'). À utiliser si la largeur/hauteur n'est pas spécifiée.
ja: コーンサーチ半径（例：'5arcmin', '0.1deg'）。幅/高さを指定しない場合に使用します。位置引数として、または-r/--radiusで指定できます。コーンサーチ半径 (例: '5arcmin', '0.1deg')。幅/高さを指定しない場合に使用します。

source: Width of a box region (e.g., '10arcmin', '0.5deg'). Requires --height.
fr: Largeur d'une région rectangulaire (ex : '10arcmin', '0.5deg'). Nécessite --height.Largeur d'une région de boîte (par exemple, '10arcmin', '0.5deg'). Nécessite --height.
ja: ボックス領域の幅（例：'10arcmin', '0.5deg'）。--heightが必要です。

source: Height of a box region (e.g., '10arcmin', '0.5deg'). Requires --width.
fr: Hauteur d'une région rectangulaire (ex : '10arcmin', '0.5deg'). Nécessite --width.Hauteur d'une région de boîte (par exemple, '10arcmin', '0.5deg'). Nécessite --width.
ja: ボックス領域の高さ（例：'10arcmin', '0.5deg'）。--widthが必要です。

source: Specific columns to retrieve. Use 'all' for all columns. Can be specified multiple times.
fr: Colonnes spécifiques à récupérer. Utilisez 'all' pour toutes les colonnes. Peut être spécifié plusieurs fois.Colonnes spécifiques à récupérer. Utilisez 'all' pour toutes les colonnes. Peut être spécifié plusieurs fois.
ja: 取得する特定の列。すべての列については'all'を使用します。複数回指定できます。取得する特定の列。すべての列を取得するには 'all' を使用します。複数指定可能です。

source: Column filters (e.g., 'Imag<15'). Can be specified multiple times.
fr: Filtres de colonne (ex : 'Imag<15'). Peut être spécifié plusieurs fois.Filtres de colonnes (par exemple, 'Imag<15'). Peuvent être spécifiés plusieurs fois.
ja: 列フィルター（例：'Imag<15'）。複数回指定できます。

source: [bold red]Error: Specify either --radius (for cone search) OR (--width and --height) (for box search), not both.[/bold red]
fr: [bold red]Erreur : Spécifiez soit --radius (pour la recherche conique) OU (--width et --height) (pour la recherche par boîte), pas les deux.[/bold red][bold red]Erreur : Spécifiez soit --radius (pour la recherche conique) OU (--width et --height) (pour la recherche de boîte), pas les deux.[/bold red]
ja: [bold red]エラー：--radius（コーンサーチ用）または（--widthと--height）（ボックスサーチ用）のいずれかを指定してください。両方は指定できません。[/bold red][bold red]エラー: --radius (コーンサーチ用) または (--width および --height) (ボックスサーチ用) のいずれかを指定してください。両方は指定できません。[/bold red]

source: [bold red]Error: For a box search, both --width and --height must be specified.[/bold red]
fr: [bold red]Erreur : Pour une recherche par boîte, --width et --height doivent tous deux être spécifiés.[/bold red][bold red]Erreur : Pour une recherche de boîte, --width et --height doivent tous deux être spécifiés.[/bold red]
ja: [bold red]エラー：ボックス検索の場合、--widthと--heightの両方を指定する必要があります。[/bold red][bold red]エラー: ボックスサーチの場合、--width と --height の両方を指定する必要があります。[/bold red]

source: [bold red]Error: You must specify search dimensions: either --radius OR (--width and --height).[/bold red]
fr: [bold red]Erreur : Vous devez spécifier les dimensions de recherche : soit --radius OU (--width et --height).[/bold red][bold red]Erreur : Vous devez spécifier les dimensions de recherche : soit --radius OU (--width et --height).[/bold red]
ja: [bold red]エラー：検索寸法を指定する必要があります：--radiusまたは（--widthと--height）のいずれか。[/bold red][bold red]エラー: 検索範囲を指定する必要があります: --radius または (--width および --height)。[/bold red]

source: Vizier region
fr: Région Vizier
ja: VizieR領域

source: Query catalogs based on specific column constraints or keywords.
fr: Interroger les catalogues basés sur des contraintes de colonne spécifiques ou des mots-clés.Interroger les catalogues basés sur des contraintes de colonnes spécifiques ou des mots-clés.
ja: 特定の列制約またはキーワードに基づいてカタログをクエリします。

source: VizieR catalog identifier(s). Can be specified multiple times.
fr: Identifiant(s) de catalogue VizieR. Peut être spécifié plusieurs fois.
ja: VizieRカタログ識別子（複数可）。複数回指定できます。

source: Constraints on column values (e.g., 'Vmag=<10', 'B-V=0.5..1.0'). Can be specified multiple times. Format: 'column_name=condition'.
fr: Contraintes sur les valeurs de colonne (ex : 'Vmag=<10', 'B-V=0.5..1.0'). Peut être spécifié plusieurs fois. Format : 'nom_colonne=condition'.Contraintes sur les valeurs de colonne (par exemple, 'Vmag=<10', 'B-V=0.5..1.0'). Peut être spécifié plusieurs fois. Format : 'nom_colonne=condition'.
ja: 列値の制約（例：'Vmag=<10', 'B-V=0.5..1.0'）。複数回指定できます。形式：'column_name=condition'。列値の制約 (例: 'Vmag=<10', 'B-V=0.5..1.0')。複数指定可能です。形式: 'column_name=condition'。

source: Keywords to filter results within the catalog (different from finding catalogs).
fr: Mots-clés pour filtrer les résultats dans le catalogue (différent de la recherche de catalogues).Mots-clés pour filtrer les résultats dans le catalogue (différent de la recherche de catalogues).
ja: カタログ内の結果をフィルタリングするキーワード（カタログを見つける場合とは異なります）。カタログ内の結果をフィルタリングするキーワード (カタログ検索とは異なります)。
