Repository: inoribea/astroquery-cli
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr, ja

source: Enable debug mode with verbose output.
fr: Activer le mode débogage avec une sortie détaillée.
ja: 詳細な出力でデバッグモードを有効にします。

source: Enable verbose output.
fr: Activer la sortie détaillée.
ja: 詳細な出力を有効にします。

source: Astroquery CLI
fr: CLI Astroquery

source: Query the VizieR astronomical catalog database. (viz)
fr: Interroger la base de données de catalogues astronomiques VizieR. (viz)
ja: VizieR天文カタログデータベースを照会します。(viz)

source: Query the SIMBAD astronomical database. (sim)
fr: Interroger la base de données astronomique SIMBAD. (sim)
ja: SIMBAD天文データベースを照会します。(sim)

source: Query the NASA Exoplanet Archive. (exo)
fr: Interroger les archives d'exoplanètes de la NASA. (exo)
ja: NASA系外惑星アーカイブを照会します。(exo)

source: Query the HEASARC database. (hea)
fr: Interroger la base de données HEASARC. (hea)
ja: HEASARCデータベースを照会します。(hea)

source: Query the Splatalogue spectral line database. (spl)
fr: Interroger la base de données des raies spectrales Splatalogue. (spl)
ja: Splatalogueスペクトル線データベースを照会します。(spl)

source: Set the language for output messages (e.g., 'en', 'zh'). Affects help texts and outputs.
fr: Définir la langue pour les messages de sortie (ex : 'en', 'fr'). Affecte les textes d'aide et les sorties.Définir la langue des messages de sortie (par exemple, 'en', 'zh'). Affecte les textes d'aide et les sorties.
ja: 出力メッセージの言語を設定します（例：'en', 'ja'）。ヘルプテキストと出力に影響します。出力メッセージの言語を設定します（例：'en'、'zh'）。ヘルプテキストと出力に影響します。

source: Test connectivity to major services (only available at top-level command).
fr: Tester la connectivité aux services majeurs (disponible uniquement au niveau de la commande principale).Tester la connectivité aux services majeurs (disponible uniquement au niveau de la commande principale).
ja: 主要サービスへの接続をテストします（トップレベルコマンドでのみ利用可能）。主要サービスへの接続をテストします（トップレベルコマンドでのみ利用可能）。

source: Test field validity for modules (only available at top-level command).
fr: Tester la validité des champs pour les modules (disponible uniquement au niveau de la commande principale).Tester la validité des champs pour les modules (disponible uniquement au niveau de la commande principale).
ja: モジュールのフィールド有効性をテストします（トップレベルコマンドでのみ利用可能）。モジュールのフィールドの有効性をテストします（トップレベルコマンドでのみ利用可能）。

source: Install completion for the current shell.
fr: Installer la complétion pour le shell actuel.
ja: 現在のシェルに補完をインストールします。

source: Show completion for the current shell, to copy it or customize the installation.
fr: Afficher la complétion pour le shell actuel, pour la copier ou personnaliser l'installation.Afficher l'autocomplétion pour le shell actuel, pour la copier ou personnaliser l'installation.
ja: 現在のシェルの補完を表示し、コピーまたはインストールをカスタマイズします。現在のシェルの補完機能を表示し、コピーまたはインストールをカスタマイズする。

source: Show this message and exit.
fr: Afficher ce message et quitter.
ja: このメッセージを表示して終了します。

source: [bold green]Debug mode enabled.[/bold green]
fr: [bold green]Mode débogage activé.[/bold green]
ja: [bold green]デバッグモードが有効になりました。[/bold green]

source: User interrupted the query. Exiting safely.
fr: L'utilisateur a interrompu la requête. Sortie en toute sécurité.
ja: ユーザーがクエリを中断しました。安全に終了します。

source: Terminal too narrow or content too complex, please open in browser:
fr: Terminal trop étroit ou contenu trop complexe, veuillez ouvrir dans un navigateur :Terminal trop étroit ou contenu trop complexe, veuillez ouvrir dans le navigateur :
ja: ターミナルが狭すぎるか、内容が複雑すぎるため、ブラウザで開いてください：ターミナルの幅が足りないか、内容が複雑すぎます。ブラウザで開いてください：

source: Terminal is narrow. Displaying only mission names for brevity. Use --show-all-cols to see descriptions.
fr: Le terminal est étroit. Affichage uniquement des noms de missions pour la brièveté. Utilisez --show-all-cols pour voir les descriptions.Le terminal est étroit. Affichage uniquement des noms de missions par souci de concision. Utilisez --show-all-cols pour voir les descriptions.
ja: ターミナルが狭いため、簡潔にするためにミッション名のみを表示しています。説明を見るには --show-all-cols を使用してください。ターミナルが狭いため、簡潔さのためにミッション名のみを表示しています。説明を見るには--show-all-colsを使用してください。

source: Path to save the output table (e.g., data.csv, results.ecsv, table.fits). Format inferred from extension.
fr: Chemin pour enregistrer la table de sortie (ex : data.csv, results.ecsv, table.fits). Le format est déduit de l'extension.Chemin pour enregistrer la table de sortie (par exemple, data.csv, results.ecsv, table.fits). Le format est déduit de l'extension.
ja: 出力テーブルを保存するパス（例：data.csv, results.ecsv, table.fits）。形式は拡張子から推測されます。出力テーブルを保存するパス（例：data.csv、results.ecsv、table.fits）。拡張子からフォーマットが推測されます。

source: Astropy table format for saving (e.g., 'csv', 'ecsv', 'fits', 'votable'). Overrides inference from filename extension.
fr: Format de table Astropy pour la sauvegarde (ex : 'csv', 'ecsv', 'fits', 'votable'). Annule l'inférence de l'extension de fichier.Format de table Astropy pour l'enregistrement (par exemple, 'csv', 'ecsv', 'fits', 'votable'). Annule l'inférence à partir de l'extension du nom de fichier.
ja: 保存するAstropyテーブル形式（例：'csv', 'ecsv', 'fits', 'votable'）。ファイル名拡張子からの推論を上書きします。保存するためのAstropyテーブル形式（例：'csv'、'ecsv'、'fits'、'votable'）。ファイル拡張子からの推論を上書きします。

source: Query the NASA Astrophysics Data System
fr: Interroger le système de données astrophysiques de la NASA.
ja: NASA天体物理データシステムを照会します。

source: Perform a query on NASA ADS.
fr: Effectuer une requête sur NASA ADS.
ja: NASA ADSでクエリを実行します。

source: ADS query string (e.g., 'author:"Adam G. Riess" year:1998', 'bibcode:1998AJ....116.1009R').
fr: Chaîne de requête ADS (par exemple, 'author:"Adam G. Riess" year:1998', 'bibcode:1998AJ....116.1009R').
ja: ADS 照会文字列 (例: 'author:"Adam G. Riess" year:1998', 'bibcode:1998AJ....116.1009R')。

source: Show latest published papers (sorted by date, most recent first).
fr: Afficher les derniers articles publiés (triés par date, du plus récent au plus ancien).Afficher les derniers articles publiés (triés par date, les plus récents en premier).
ja: 最新の公開論文を表示（日付でソート、新しい順）。

source: Show highly cited review articles (sorted by citation count).
fr: Afficher les articles de revue très cités (triés par nombre de citations).Afficher les articles de revue très cités (triés par nombre de citations).
ja: 高引用レビュー記事を表示（引用数でソート）。

source: Fields to return.
fr: Champs à retourner.
ja: 返却するフィールド。

source: Sort results by (e.g., 'date', 'citation_count', 'score').
fr: Trier les résultats par (ex : 'date', 'citation_count', 'score').Trier les résultats par (par exemple, 'date', 'citation_count', 'score').
ja: 結果をソートする基準（例：'date', 'citation_count', 'score'）。結果のソート順 (例: 'date' (日付), 'citation_count' (引用数), 'score' (スコア))。

source: Maximum number of pages to retrieve.
fr: Nombre maximal de pages à récupérer.
ja: 取得する最大ページ数。

source: Number of results per page (max 200 for ADS API).
fr: Nombre de résultats par page (max 200 pour l'API ADS).
ja: ページあたりの結果数（ADS APIでは最大200）。

source: Maximum number of rows to display. Use -1 for all rows.
fr: Nombre maximal de lignes à afficher. Utilisez -1 pour toutes les lignes.Nombre maximum de lignes à afficher. Utilisez -1 pour toutes les lignes.
ja: 表示する最大行数。すべての行を表示するには-1を使用します。

source: Show all columns in the output table.
fr: Afficher toutes les colonnes dans la table de sortie.
ja: 出力テーブルのすべての列を表示します。

source: [red]Cannot specify both --latest and --review. Please choose only one.[/red]
fr: [red]Impossible de spécifier à la fois --latest et --review. Veuillez choisir un seul.[/red][red]Vous ne pouvez pas spécifier à la fois -w/--wavelength-range et -f/--frequency-range.[/red]
ja: [red]--latest と --review を両方指定することはできません。どちらか一方を選択してください。[/red][red]-w/--wavelength-range と -f/--frequency-range の両方を指定することはできません。[/red]

source: [red]Please specify a query string, --latest, or --review.[/red]
fr: [red]Veuillez spécifier une chaîne de requête, --latest, ou --review.[/red][red]Veuillez spécifier une chaîne de requête, --latest, ou --review.[/red][red]Veuillez spécifier une chaîne de requête, --latest, ou --review.[/red]
ja: [red]クエリ文字列、--latest、または--reviewを指定してください。[/red]

source: Querying NASA ADS for latest papers
fr: Interrogation de NASA ADS pour les derniers articles
ja: NASA ADSで最新論文をクエリ中

source: Querying NASA ADS for highly cited review articles (using property:review)
fr: Interrogation de NASA ADS pour les articles de revue très cités (en utilisant la propriété :review)Interrogation de NASA ADS pour les articles de revue très cités (en utilisant la propriété :review).Interrogation de NASA ADS pour les articles de revue très cités (en utilisant la propriété :review).
ja: NASA ADSで高引用レビュー記事をクエリ中（プロパティ：reviewを使用）

source: Querying NASA ADS with: {query_string}
fr: Interrogation de NASA ADS avec :
ja: NASA ADSでクエリ中：

source: [red]Error: No valid query could be formed. Please check your inputs.[/red]
fr: [red]Erreur : Aucune requête valide n'a pu être formée. Veuillez vérifier vos entrées.[/red][red]Erreur : Aucune requête valide n'a pu être formée. Veuillez vérifier vos entrées.[/red][red]Erreur : Aucune requête valide n'a pu être formée. Veuillez vérifier vos entrées.[/red]
ja: [red]エラー：有効なクエリを形成できませんでした。入力を確認してください。[/red][red]エラー: 有効なクエリを形成できませんでした。入力を確認してください。[/red][red]エラー: 有効なクエリを形成できませんでした。入力を確認してください。[/red]

source: [red]Error: No NASA ADS API token found! Please get yours from: https://ui.adsabs.harvard.edu/user/settings/token and set it in the ADS_DEV_KEY environment variable or in your ~/.aqc/config.ini file.[/red]
fr: [red]Erreur : Aucun jeton d'API NASA ADS trouvé ! Veuillez obtenir le vôtre sur : https://ui.adsabs.harvard.edu/user/settings/token et le définir dans la variable d'environnement ADS_DEV_KEY ou dans votre fichier ~/.aqc/config.ini.[/red][red]Erreur : Aucun jeton d'API NASA ADS trouvé ! Veuillez obtenir le vôtre à l'adresse suivante : https://ui.adsabs.harvard.edu/user/settings/token et le définir dans la variable d'environnement ADS_DEV_KEY ou dans votre fichier ~/.aqc/config.ini.[/red]
ja: [red]エラー：NASA ADS APIトークンが見つかりません！トークンは https://ui.adsabs.harvard.edu/user/settings/token で取得し、ADS_DEV_KEY 環境変数または ~/.aqc/config.ini ファイルに設定してください。[/red][red]エラー: NASA ADS APIトークンが見つかりません！次のURLから取得してください: https://ui.adsabs.harvard.edu/user/settings/token。そして、ADS_DEV_KEY環境変数または~/.aqc/config.iniファイルに設定してください。[/red]

source: [yellow]No results found for your ADS query.[/yellow]
fr: [yellow]Aucun résultat trouvé pour votre requête ADS.[/yellow]
ja: [yellow]あなたのADSクエリの結果は見つかりませんでした。[/yellow]

source: [yellow]None of the requested fields were found in the ADS query results.[/yellow]
fr: [yellow]Aucun des champs demandés n'a été trouvé dans les résultats de la requête ADS.[/yellow]
ja: [yellow]ADSクエリ結果で要求されたフィールドはいずれも見つかりませんでした。[/yellow]

source: [green]Found {count} result(s) from ADS.[/green]
fr: [green]Trouvé résultat(s) d'ADS.[/green]
ja: [green]ADSから 件の結果が見つかりました。[/green]

source: ADS Query Results
fr: Résultats de la requête ADS
ja: ADSクエリ結果

source: NASA ADS query
fr: Requête NASA ADS
ja: NASA ADSクエリ

source: Get BibTeX for a NASA ADS bibcode.
fr: Obtenir BibTeX pour un bibcode NASA ADS.
ja: NASA ADS bibcodeのBibTeXを取得します。

source: List of ADS bibcodes.
fr: Liste des bibcodes ADS.
ja: ADS bibcodeのリスト。

source: File to save BibTeX entries (e.g., refs.bib).
fr: Fichier pour enregistrer les entrées BibTeX (ex : refs.bib).
ja: BibTeXエントリを保存するファイル（例：refs.bib）。

source: [cyan]Fetching BibTeX for: {bibcode_list}...[/cyan]
fr: [cyan]Récupération de BibTeX pour : ...[/cyan]
ja: [cyan]BibTeXを取得中：...[/cyan]

source: [yellow]Warning: ADS_DEV_KEY environment variable not set. Queries may be rate-limited.[/yellow]
fr: [yellow]Avertissement : la variable d'environnement ADS_DEV_KEY n'est pas définie. Les requêtes peuvent être soumises à une limitation de débit.[/yellow][yellow]Avertissement : La variable d'environnement ADS_DEV_KEY n'est pas définie. Les requêtes peuvent être soumises à des limitations de débit.[/yellow]
ja: [yellow]警告：ADS_DEV_KEY環境変数が設定されていません。クエリがレート制限される可能性があります。[/yellow][yellow]警告: ADS_DEV_KEY 環境変数が設定されていません。クエリがレート制限される可能性があります。[/yellow]

source: [yellow]Could not retrieve BibTeX for {bibcode}.[/yellow]
fr: [yellow]Impossible de récupérer BibTeX pour .[/yellow]
ja: [yellow] のBibTeXを取得できませんでした。[/yellow]

source: [green]BibTeX entries retrieved:[/green]
fr: [green]Entrées BibTeX récupérées :[/green]
ja: [green]BibTeXエントリが取得されました：[/green]

source: [green]BibTeX entries saved to '{file_path}'.[/green]
fr: [green]Entrées BibTeX enregistrées dans ''.[/green]
ja: [green]BibTeXエントリは '' に保存されました。[/green]

source: [yellow]No BibTeX entries could be retrieved.[/yellow]
fr: [yellow]Aucune entrée BibTeX n'a pu être récupérée.[/yellow]
ja: [yellow]BibTeXエントリを取得できませんでした。[/yellow]

source: NASA ADS get_bibtex
fr: NASA ADS obtenir le BibTeX

source: Query the ALMA archive.
fr: Interroger l'archive ALMA.
ja: ALMAアーカイブをクエリします。

source: Query ALMA for observations of an object.
fr: Interroger ALMA pour des observations d'un objet.
ja: 天体の観測についてALMAにクエリします。

source: Name of the astronomical object, e.g., 'Orion KL', 'Sgr B2', 'NGC 253'.
fr: Nom de l'objet astronomique, ex : 'Orion KL', 'Sgr B2', 'NGC 253'.
ja: 天体名、例：'Orion KL', 'Sgr B2', 'NGC 253'。

source: Query only public data.
fr: Interroger uniquement les données publiques.
ja: 公開データのみをクエリします。

source: Query only science data.
fr: Interroger uniquement les données scientifiques.
ja: 科学データのみをクエリします。

source: Specify payload fields to query (e.g., 'band_list', 'target_name').
fr: Spécifier les champs de charge utile à interroger (ex : 'band_list', 'target_name').Spécifier les champs de la charge utile à interroger (par exemple, 'band_list', 'target_name').
ja: クエリするペイロードフィールドを指定します（例：'band_list', 'target_name'）。照会する payload フィールドを指定します (例: 'band_list', 'target_name')。

source: Querying ALMA for object: {object_name}
fr: Interrogation d'ALMA pour l'objet : {object_name}
ja: ALMAでオブジェクトを照会中：{object_name}

source: [yellow]Payload item '{item}' is not a key=value pair. Ignoring.[/yellow]
fr: [yellow]L'élément de charge utile '' n'est pas une paire clé=valeur. Ignoré.[/yellow][yellow]L'élément de charge utile '{item}' n'est pas une paire clé=valeur. Ignoré.[/yellow]
ja: [yellow]ペイロード項目 '' はキー=値のペアではありません。無視します。[/yellow][yellow]payload 項目 '{item}' は key=value のペアではありません。無視します。[/yellow]

source: [green]Found {count} match(es) for '{object_name}'.[/green]
fr: [green]Trouvé correspondance(s) pour ''.[/green]
ja: [green]'' の一致が 件見つかりました。[/green]

source: ALMA Data for {object_name}
fr: Données ALMA pour
ja: のALMAデータ

source: ALMA object query
fr: Requête objet ALMA
ja: ALMAオブジェクトクエリ

source: [yellow]No information found for object '{object_name}'.[/yellow]
fr: [yellow]Aucune information trouvée pour l'objet ''.[/yellow][yellow]Aucune information trouvée pour l'objet '{object_name}'.[/yellow]
ja: [yellow]オブジェクト '' の情報は見つかりませんでした。[/yellow]

source: ALMA object
fr: Objet ALMA
ja: ALMAオブジェクト

source: Query ALMA for observations in a sky region.
fr: Interroger ALMA pour des observations dans une région du ciel.
ja: 空の領域の観測についてALMAにクエリします。

source: Coordinates (e.g., '10.68h +41.26d', '150.0 2.0').
fr: Coordonnées (ex : '10.68h +41.26d', '150.0 2.0').
ja: 座標（例：'10.68h +41.26d', '150.0 2.0'）。

source: Search radius (e.g., '0.1deg', '5arcmin').
fr: Rayon de recherche (ex : '0.1deg', '5arcmin').
ja: 検索半径（例：'0.1deg', '5arcmin'）。

source: Querying ALMA for region: {coordinates} with radius {radius}
fr: Interrogation d'ALMA pour la région : {coordinates} avec un rayon de {radius}
ja: ALMAで領域を照会中：{coordinates}、半径{radius}

source: [green]Found {count} match(es) in the region.[/green]
fr: [green]Trouvé correspondance(s) dans la région.[/green]
ja: [green]領域で 件の一致が見つかりました。[/green]

source: ALMA Data for Region
fr: Données ALMA pour la région
ja: ALMA領域データ

source: ALMA region query
fr: Requête région ALMA
ja: ALMA領域クエリ

source: [yellow]No information found for the specified region.[/yellow]
fr: [yellow]Aucune information trouvée pour la région spécifiée.[/yellow]
ja: [yellow]指定された領域の情報は見つかりませんでした。[/yellow]

source: ALMA region
fr: Région ALMA
ja: ALMA領域

source: Query the ESA Sky archive.
fr: Interroger l'archive ESA Sky.
ja: ESA Skyアーカイブをクエリします。

source: Query ESASky catalogs for an object.
fr: Interroger les catalogues ESASky pour un objet.
ja: 天体についてESASkyカタログにクエリします。

source: Name of the astronomical object (e.g., 'NGC 253', 'HD 189733'). eg：M31、NGC 253、HD 189733
fr: Nom de l'objet astronomique (ex : 'NGC 253', 'HD 189733'). ex : M31, NGC 253, HD 189733Nom de l'objet astronomique (par exemple, 'NGC 253', 'HD 189733'). Ex: M31, NGC 253, HD 189733
ja: 天体の名前（例：'NGC 253', 'HD 189733'）。例：M31、NGC 253、HD 189733

source: Specify catalogs to query (e.g., 'GAIA-DR3', '2MASS', 'ALLWISE'). Can be specified multiple times. Use 'list-catalogs' command to see all available catalogs. Default: GAIA-DR3.
fr: Spécifier les catalogues à interroger (ex : 'GAIA-DR3', '2MASS', 'ALLWISE'). Peut être spécifié plusieurs fois. Utilisez la commande 'list-catalogs' pour voir tous les catalogues disponibles. Par défaut : GAIA-DR3.Spécifiez les catalogues à interroger (par exemple, 'GAIA-DR3', '2MASS', 'ALLWISE'). Peut être spécifié plusieurs fois. Utilisez la commande 'list-catalogs' pour voir tous les catalogues disponibles. Par défaut : GAIA-DR3.Spécifier les catalogues à interroger (par exemple, 'Gaia DR3'). Peut être spécifié plusieurs fois.
ja: クエリするカタログを指定します（例：'GAIA-DR3', '2MASS', 'ALLWISE'）。複数回指定できます。利用可能なすべてのカタログを見るには 'list-catalogs' コマンドを使用してください。デフォルト：GAIA-DR3。照会するカタログを指定します（例：'GAIA-DR3'、'2MASS'、'ALLWISE'）。複数回指定できます。「list-catalogs」コマンドを使用して、利用可能なすべてのカタログを表示します。デフォルト：GAIA-DR3。

source: Enable test mode and print elapsed time.
fr: Activer le mode test et afficher le temps écoulé.
ja: テストモードを有効にし、経過時間を表示します。

source: [cyan]Querying ESASky catalogs for object: '{object_name}'...[/cyan]
fr: [cyan]Interrogation des catalogues ESASky pour l'objet : ''...[/cyan][cyan]Interrogation des catalogues ESASky pour l'objet : '{object_name}'...[/cyan]
ja: [cyan]ESASkyカタログでオブジェクト '' をクエリ中...[/cyan]

source: [green]Found data for '{object_name}' in {count} catalog(s).[/green]
fr: [green]Données trouvées pour '' dans catalogue(s).[/green][green]Données trouvées pour '{object_name}' dans {count} catalogue(s).[/green]
ja: [green]'' のデータが 件のカタログで見つかりました。[/green][green]'{object_name}' のデータが {count} 件のカタログで見つかりました。[/green]

source: ESASky: {cat_name} for {object_name}
fr: ESASky : pour
ja: ESASky: の

source: ESASky {cat_name} object query
fr: Requête objet ESASky
ja: ESASky オブジェクトクエリ

source: [yellow]No results from catalog '{cat_name}' for '{object_name}'.[/yellow]
fr: [yellow]Aucun résultat du catalogue '' pour ''.[/yellow][yellow]Aucun résultat du catalogue '{cat_name}' pour '{object_name}'.[/yellow]
ja: [yellow]カタログ '' から '' の結果はありません。[/yellow][yellow]カタログ '{cat_name}' には '{object_name}' の結果がありません。[/yellow]

source: ESASky object result
fr: Résultat objet ESASky
ja: ESASkyオブジェクト結果

source: ESASky object query
fr: Requête objet ESASky
ja: ESASkyオブジェクトクエリ

source: [yellow]Unknown result type from ESASky.query_object_catalogs.[/yellow]
fr: [yellow]Type de résultat inconnu de ESASky.query_object_catalogs.[/yellow]
ja: [yellow]ESASky.query_object_catalogs からの不明な結果タイプ。[/yellow]

source: [yellow]No catalog information found for object '{object_name}'.[/yellow]
fr: [yellow]Aucune information de catalogue trouvée pour l'objet ''.[/yellow][yellow]Aucune information de catalogue trouvée pour l'objet '{object_name}'.[/yellow]
ja: [yellow]オブジェクト '' のカタログ情報は見つかりませんでした。[/yellow][yellow]天体 '{object_name}' のカタログ情報は見つかりませんでした。[/yellow]

source: ESASky object
fr: Objet ESASky
ja: ESASkyオブジェクト

source: Query ESASky catalogs in a sky region.
fr: Interroger les catalogues ESASky dans une région du ciel.
ja: 空の領域でESASkyカタログにクエリします。

source: Coordinates (e.g., '10.68h +41.26d', 'M101', '299.86808 -14.67788').
fr: Coordonnées (ex : '10.68h +41.26d', 'M101', '299.86808 -14.67788').
ja: 座標（例：'10.68h +41.26d', 'M101', '299.86808 -14.67788'）。

source: Search radius (e.g., '0.1deg', '5arcmin', '10s').
fr: Rayon de recherche (ex : '0.1deg', '5arcmin', '10s').
ja: 検索半径（例：'0.1deg', '5arcmin', '10s'）。

source: Specify catalogs to query (e.g., 'XMM-Newton (XMM-SSC)', 'atnfpsr (CDA)'). Can be specified multiple times. Use 'object' command to see all available catalogs.
fr: Spécifier les catalogues à interroger (ex : 'XMM-Newton (XMM-SSC)', 'atnfpsr (CDA)'). Peut être spécifié plusieurs fois. Utilisez la commande 'object' pour voir tous les catalogues disponibles.Spécifiez les catalogues à interroger (par exemple, 'XMM-Newton (XMM-SSC)', 'atnfpsr (CDA)'). Peut être spécifié plusieurs fois. Utilisez la commande 'object' pour voir tous les catalogues disponibles.Spécifier les catalogues à interroger (par exemple, 'Gaia DR3'). Peut être spécifié plusieurs fois.
ja: クエリするカタログを指定します（例：'XMM-Newton (XMM-SSC)', 'atnfpsr (CDA)'）。複数回指定できます。利用可能なすべてのカタログを見るには 'object' コマンドを使用してください。照会するカタログを指定します（例：'XMM-Newton (XMM-SSC)'、'atnfpsr (CDA)'）。複数回指定できます。「object」コマンドを使用して、利用可能なすべてのカタログを表示します。

source: [cyan]Querying ESASky catalogs for region: '{coordinates}' with radius '{radius}'...[/cyan]
fr: [cyan]Interrogation des catalogues ESASky pour la région : '' avec un rayon ''...[/cyan][cyan]Interrogation des catalogues ESASky pour la région : '{coordinates}' avec un rayon de '{radius}'...[/cyan]
ja: [cyan]ESASkyカタログで領域 '' を半径 '' でクエリ中...[/cyan][cyan]領域 '{coordinates}'、半径 '{radius}' のESASkyカタログを照会中...[/cyan]

source: [green]Found data in {count} catalog(s) for the region.[/green]
fr: [green]Données trouvées dans catalogue(s) pour la région.[/green][green]Données trouvées dans {count} catalogue(s) pour la région.[/green]
ja: [green]領域のデータが 件のカタログで見つかりました。[/green]

source: ESASky: {cat_name} for region
fr: ESASky : pour la région
ja: ESASky: 領域の

source: ESASky {cat_name} region query
fr: Requête région ESASky
ja: ESASky 領域クエリ

source: [yellow]No results from catalog '{cat_name}' for the region.[/yellow]
fr: [yellow]Aucun résultat du catalogue '' pour la région.[/yellow][yellow]Aucun résultat du catalogue '{cat_name}' pour la région.[/yellow]
ja: [yellow]カタログ '' から領域の結果はありません。[/yellow]

source: [yellow]No catalog information found for the specified region.[/yellow]
fr: [yellow]Aucune information de catalogue trouvée pour la région spécifiée.[/yellow][yellow]Aucune information de catalogue trouvée pour la région spécifiée.[/yellow]
ja: [yellow]指定された領域のカタログ情報は見つかりませんでした。[/yellow]

source: ESASky region
fr: Région ESASky
ja: ESASky領域

source: List available missions/catalogs in ESASky.
fr: Lister les missions/catalogues disponibles dans ESASky.
ja: ESASkyで利用可能なミッション/カタログをリスト表示します。

source: [cyan]Fetching list of available ESASky missions/catalogs...[/cyan]
fr: [cyan]Récupération de la liste des missions/catalogues ESASky disponibles...[/cyan][cyan]Récupération de la liste des missions/catalogues ESASky disponibles...[/cyan]
ja: [cyan]利用可能なESASkyミッション/カタログのリストを取得中...[/cyan]

source: [bold red]Unexpected list content from ESASky.list_catalogs(). Expected list of strings or AstropyTable.[/bold red]
fr: [bold red]Contenu de liste inattendu de ESASky.list_catalogs(). Attendu une liste de chaînes de caractères ou AstropyTable.[/bold red][rouge gras]Contenu de liste inattendu de ESASky.list_catalogs(). Une liste de chaînes de caractères ou une AstropyTable était attendue.[/rouge gras]
ja: [bold red]ESASky.list_catalogs()からの予期しないリスト内容。文字列のリストまたはAstropyTableが期待されます。[/bold red][太字赤]ESASky.list_catalogs()からの予期せぬリスト内容です。文字列のリストまたはAstropyTableが期待されました。[/太字赤]

source: [bold red]Unexpected return type from ESASky.list_catalogs(). Expected AstropyTable or list.[/bold red]
fr: [bold red]Type de retour inattendu de ESASky.list_catalogs(). Attendu AstropyTable ou liste.[/bold red][rouge gras]Type de retour inattendu de ESASky.list_catalogs(). Une AstropyTable ou une liste était attendue.[/rouge gras]
ja: [bold red]ESASky.list_catalogs()からの予期しない戻り値の型。AstropyTableまたはリストが期待されます。[/bold red][太字赤]ESASky.list_catalogs()からの予期せぬ戻り値の型です。AstropyTableまたはリストが期待されました。[/太字赤]
