Repository: inoribea/astroquery-cli
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr, ja

source: IRSA dust maps operations.
fr: Opérations de cartes de poussière IRSA.
ja: IRSAダストマップ操作。

source: Get E(B-V) dust extinction values for one or more coordinates.
fr: Obtenir les valeurs d'extinction de poussière E(B-V) pour une ou plusieurs coordonnées.Obtenir les valeurs d'extinction de poussière E(B-V) pour une ou plusieurs coordonnées.
ja: 1つ以上の座標のE(B-V)ダスト消光値を取得します。

source: Object name(s) or coordinate(s) (e.g., 'M31', '10.68h +41.26d', '160.32 41.45'). Can be specified multiple times.
fr: Nom(s) de l'objet ou coordonnée(s) (ex : 'M31', '10.68h +41.26d', '160.32 41.45'). Peut être spécifié plusieurs fois.Nom(s) d'objet(s) ou coordonnée(s) (par exemple, 'M31', '10.68h +41.26d', '160.32 41.45'). Peut être spécifié plusieurs fois.
ja: 天体名または座標（複数可）（例：'M31', '10.68h +41.26d', '160.32 41.45'）。複数回指定できます。天体名または座標 (例: 'M31', '10.68h +41.26d', '160.32 41.45')。複数指定可能です。

source: Dust map to query ('SFD', 'Planck', 'IRIS'). SFD is Schlegel, Finkbeiner & Davis (1998).
fr: Carte de poussière à interroger ('SFD', 'Planck', 'IRIS'). SFD est Schlegel, Finkbeiner & Davis (1998).Carte de poussière à interroger ('SFD', 'Planck', 'IRIS'). SFD est Schlegel, Finkbeiner & Davis (1998).
ja: クエリするダストマップ（'SFD', 'Planck', 'IRIS'）。SFDはSchlegel, Finkbeiner & Davis (1998)です。照会するダストマップ ('SFD', 'Planck', 'IRIS')。SFD は Schlegel, Finkbeiner & Davis (1998) です。

source: [cyan]Querying IRSA Dust ({map_name}) for extinction at: {targets_str}...[/cyan]
fr: [cyan]Interrogation de IRSA Dust () pour l'extinction à : ...[/cyan][cyan]Interrogation de la poussière IRSA ({map_name}) pour l'extinction à : {targets_str}...[/cyan]
ja: [cyan]IRSA Dust () で消光をクエリ中：...[/cyan]

source: [red]No valid coordinates parsed.[/red]
fr: [red]Aucune coordonnée valide analysée.[/red]
ja: [red]有効な座標が解析されませんでした。[/red]

source: Fetching extinction for each target individually...
fr: Récupération de l'extinction pour chaque cible individuellement...
ja: 各ターゲットの消光を個別に取得中...

source: Processing target {current_num}/{total_num}: {target_name}
fr: Traitement de la cible {current_num}/{total_num} : {target_name}
ja: ターゲット {current_num}/{total_num} を処理中：{target_name}

source: [yellow]Could not get extinction for '{target_name}': {error}[/yellow]
fr: [yellow]Impossible d'obtenir l'extinction pour '' : [/yellow][yellow]Impossible d'obtenir l'extinction pour '{target_name}' : {error}[/yellow]
ja: [yellow]'' の消光を取得できませんでした：[/yellow]

source: [yellow]No extinction data retrieved for any target.[/yellow]
fr: [yellow]Aucune donnée d'extinction récupérée pour aucune cible.[/yellow][yellow]Aucune donnée d'extinction récupérée pour aucune cible.[/yellow]
ja: [yellow]どのターゲットの消光データも取得されませんでした。[/yellow]

source: IRSA Dust Extinction ({map_name})
fr: Extinction de poussière IRSA ()
ja: IRSAダスト消光 ()

source: IRSA Dust {map_name} extinction
fr: IRSA Poussière extinction
ja: IRSAダスト 消光

source: [yellow]No extinction data returned by IRSA Dust ({map_name}).[/yellow]
fr: [yellow]Aucune donnée d'extinction retournée par IRSA Dust ().[/yellow][yellow]Aucune donnée d'extinction renvoyée par IRSA Dust ({map_name}).[/yellow]
ja: [yellow]IRSA Dust () から消光データは返されませんでした。[/yellow][yellow]IRSA Dust ({map_name}) から吸収データが返されませんでした。[/yellow]

source: IRSA Dust ({map_name}) get_extinction_table
fr: IRSA Poussière () get_extinction_table
ja: IRSAダスト () 消光テーブル取得

source: Get a FITS image of a dust map for a region.
fr: Obtenir une image FITS d'une carte de poussière pour une région.
ja: 領域のダストマップのFITS画像を取得します。

source: Radius of the image (e.g., '30arcmin', '1.5deg').
fr: Rayon de l'image (ex : '30arcmin', '1.5deg').
ja: 画像の半径（例：'30arcmin', '1.5deg'）。

source: Dust map to query ('SFD', 'Planck', 'IRIS').
fr: Carte de poussière à interroger ('SFD', 'Planck', 'IRIS').
ja: クエリするダストマップ（'SFD', 'Planck', 'IRIS'）。

source: Directory to save the FITS image(s).
fr: Répertoire pour enregistrer l'image(s) FITS.
ja: FITS画像を保存するディレクトリ。

source: Prefix for the output FITS filename(s).
fr: Préfixe pour le(s) nom(s) de fichier FITS de sortie.
ja: 出力FITSファイル名のプレフィックス。

source: [cyan]Querying IRSA Dust ({map_name}) for map around '{target}' with radius {radius}...[/cyan]
fr: [cyan]Interrogation de IRSA Dust () pour la carte autour de '' avec un rayon ...[/cyan][cyan]Interrogation de la poussière IRSA ({map_name}) pour la carte autour de '{target}' avec un rayon de {radius}...[/cyan]
ja: [cyan]IRSA Dust () で '' 周辺のマップを半径 でクエリ中...[/cyan][cyan]IRSA Dust ({map_name}) で '{target}' の周囲 (半径 {radius}) のマップを照会中...[/cyan]

source: [bold red]Error parsing input: {error}[/bold red]
fr: [bold red]Erreur lors de l'analyse de l'entrée : [/bold red]
ja: [bold red]入力解析エラー：[/bold red]

source: Created output directory: {output_dir}
fr: Répertoire de sortie créé :
ja: 出力ディレクトリを作成しました：

source: [yellow]No map images returned by IRSA Dust ({map_name}) for this region.[/yellow]
fr: [yellow]Aucune image de carte retournée par IRSA Dust () pour cette région.[/yellow][yellow]Aucune image de carte renvoyée par IRSA Dust ({map_name}) pour cette région.[/yellow]
ja: [yellow]この領域のIRSA Dust () からマップ画像は返されませんでした。[/yellow][yellow]この領域について、IRSA Dust ({map_name}) からマップ画像が返されませんでした。[/yellow]

source: [green]Saved dust map: {filename}[/green]
fr: [green]Carte de poussière enregistrée : [/green]
ja: [green]ダストマップを保存しました：[/green]

source: IRSA Dust ({map_name}) get_images
fr: IRSA Poussière () get_images
ja: IRSAダスト () 画像取得

source: Query JPL services (Horizons and Small-Body Database).
fr: Interroger les services du JPL (Horizons et Base de données des petits corps).
ja: JPLサービス（Horizonsおよび小惑星データベース）を照会します。

source: Query ephemerides, orbital elements, or vectors for a target object. (h)
fr: Interroger les éphémérides, les éléments orbitaux ou les vecteurs pour un objet cible. (h)
ja: ターゲットオブジェクトの天体暦、軌道要素、またはベクトルを照会します。(h)

source: Alias for horizons.
fr: Alias pour horizons.
ja: Horizonsのエイリアス。

source: Object ID (e.g., 'Mars', 'Ceres', '2000NM', '@10'). Use '@' prefix for spacecraft ID.
fr: ID d'objet (ex : 'Mars', 'Ceres', '2000NM', '@10'). Utilisez le préfixe '@' pour l'ID du vaisseau spatial.ID d'objet (par exemple, 'Mars', 'Ceres', '2000NM', '@10'). Utiliser le préfixe '@' pour l'ID de vaisseau spatial.
ja: 天体ID（例：'Mars', 'Ceres', '2000NM', '@10'）。宇宙船IDには'@'プレフィックスを使用します。天体ID (例: 'Mars' (火星), 'Ceres' (ケレス), '2000NM', '@10')。宇宙機のIDには '@' プレフィックスを使用します。

source: Epochs for the query. Can be a single ISO time (e.g., '2023-01-01 12:00'), a list of times separated by commas (e.g., '2023-01-01,2023-01-02'), or a start,stop,step dict-like string (e.g., "{'start':'2023-01-01', 'stop':'2023-01-05', 'step':'1d'}"). If None, uses current time for single epoch queries like elements/vectors.
fr: Époques pour la requête. Peut être une seule heure ISO (par exemple, '2023-01-01 12:00'), une liste d'heures séparées par des virgules (par exemple, '2023-01-01,2023-01-02'), ou une chaîne de type dictionnaire start,stop,step (par exemple, "{'start':'2023-01-01', 'stop':'2023-01-05', 'step':'1d'}"). Si None, utilise l'heure actuelle pour les requêtes à époque unique comme les éléments/vecteurs.
ja: 照会の元期。単一のISO時刻 (例: '2023-01-01 12:00')、カンマ区切りの時刻リスト (例: '2023-01-01,2023-01-02')、または start,stop,step 形式の辞書風文字列 (例: "{'start':'2023-01-01', 'stop':'2023-01-05', 'step':'1d'}") が指定できます。None の場合、要素/ベクトルなどの単一元期照会には現在時刻が使用されます。

source: Start time for ephemeris range (YYYY-MM-DD [HH:MM]). Overrides 'epochs' if 'end_time' is also set.
fr: Heure de début pour la plage d'éphémérides (AAAA-MM-JJ [HH:MM]). Annule 'epochs' si 'end_time' est également défini.Heure de début pour la plage d'éphémérides (AAAA-MM-JJ [HH:MM]). Remplace 'epochs' si 'end_time' est également défini.
ja: 天体暦範囲の開始時刻（YYYY-MM-DD [HH:MM]）。'end_time'も設定されている場合、'epochs'を上書きします。天体暦範囲の開始時刻 (YYYY-MM-DD [HH:MM])。'end_time' も設定されている場合、'epochs' を上書きします。

source: End time for ephemeris range (YYYY-MM-DD [HH:MM]).
fr: Heure de fin pour la plage d'éphémérides (AAAA-MM-JJ [HH:MM]).
ja: 天体暦範囲の終了時刻（YYYY-MM-DD [HH:MM]）。

source: Time step for ephemeris range (e.g., '1d', '1h', '10m'). Used if 'start_time' and 'end_time' are set.
fr: Pas de temps pour la plage d'éphémérides (ex : '1d', '1h', '10m'). Utilisé si 'start_time' et 'end_time' sont définis.Pas de temps pour la plage d'éphémérides (par exemple, '1d', '1h', '10m'). Utilisé si 'start_time' et 'end_time' sont définis.
ja: 天体暦範囲の時間ステップ（例：'1d', '1h', '10m'）。'start_time'と'end_time'が設定されている場合に使用されます。天体暦範囲の時間ステップ (例: '1d', '1h', '10m')。'start_time' と 'end_time' が設定されている場合に使用されます。

source: Observatory code (e.g., '500' for Geocenter, 'geo' is alias for '500'). Try common codes or find specific ones.
fr: Code d'observatoire (ex : '500' pour le Géocentre, 'geo' est un alias pour '500'). Essayez les codes courants ou trouvez des codes spécifiques.Code de l'observatoire (par exemple, '500' pour Géocentre, 'geo' est un alias pour '500'). Essayez les codes courants ou trouvez des codes spécifiques.
ja: 観測所コード（例：地心の場合は'500'、'geo'は'500'のエイリアス）。一般的なコードを試すか、特定のコードを見つけてください。観測所コード (例: 地心の場合は '500'、'geo' は '500' のエイリアス)。一般的なコードを試すか、特定のコードを検索してください。

source: Type of the target identifier. If None, Horizons will try to guess.
fr: Type de l'identifiant de la cible. Si None, Horizons essaiera de deviner.
ja: ターゲット識別子のタイプ。Noneの場合、Horizonsが推測を試みます。

source: Type of ephemeris to retrieve.
fr: Type d'éphémérides à récupérer.
ja: 取得する天体暦のタイプ。

source: Comma-separated string of quantity codes (e.g., '1,2,19,20'). Relevant for OBSERVER and VECTORS. See JPL Horizons docs for codes. Uses sensible defaults if None.
fr: Chaîne de codes de quantité séparés par des virgules (ex : '1,2,19,20'). Pertinent pour OBSERVER et VECTORS. Voir la documentation JPL Horizons pour les codes. Utilise des valeurs par défaut si aucune n'est spécifiée.Chaîne de codes de quantité séparés par des virgules (par exemple, '1,2,19,20'). Pertinent pour OBSERVER et VECTORS. Voir la documentation JPL Horizons pour les codes. Utilise des valeurs par défaut sensées si None.
ja: カンマ区切りの数量コード文字列（例：'1,2,19,20'）。OBSERVERとVECTORSに関連します。コードについてはJPL Horizonsのドキュメントを参照してください。指定がない場合は適切なデフォルト値を使用します。カンマ区切りの物理量コード文字列 (例: '1,2,19,20')。OBSERVER および VECTORS に関連します。コードについては JPL Horizons のドキュメントを参照してください。None の場合は適切なデフォルト値が使用されます。

source: Show all columns in the output table, even if wide.
fr: Afficher toutes les colonnes dans la table de sortie, même si elles sont larges.
ja: 幅広の場合でも、出力テーブルのすべての列を表示します。

source: JPL Horizons server to use. Choices: {server_list}
fr: Serveur JPL Horizons à utiliser. Choix :
ja: 使用するJPL Horizonsサーバー。選択肢：

source: [cyan]Querying JPL Horizons for '{target}'...[/cyan]
fr: [cyan]Interrogation de JPL Horizons pour ''...[/cyan]
ja: [cyan]JPL Horizonsで '' をクエリ中...[/cyan]

source: Using JPL server: {server}
fr: Utilisation du serveur JPL :
ja: JPLサーバーを使用中：

source: Using epoch range: {start} to {end} with step {step}
fr: Utilisation de la plage d'époques : à avec un pas de
ja: エポック範囲を使用中： から まで、ステップ

source: Using epoch dict: {epoch_dict}
fr: Utilisation du dictionnaire d'époque :
ja: エポック辞書を使用中：

source: [red]Error parsing epoch dictionary: {error}. Please ensure it's a valid Python dictionary string.[/red]
fr: [red]Erreur lors de l'analyse du dictionnaire d'époque : . Veuillez vous assurer qu'il s'agit d'une chaîne de dictionnaire Python valide.[/red][red]Erreur lors de l'analyse du dictionnaire d'époque : . Veuillez vous assurer qu'il s'agit d'une chaîne de dictionnaire Python valide.[/red]
ja: [red]エポック辞書の解析エラー：。有効なPython辞書文字列であることを確認してください。[/red][red]エポック辞書の解析エラー：。有効なPython辞書文字列であることを確認してください。[/red]

source: {ephem_type} for {target}
fr: pour
ja: の

source: Requesting quantities: {quantities}
fr: Demande de quantités :
ja: 数量を要求中：

source: Requesting quantities for vectors: {quantities}
fr: Demande de quantités pour les vecteurs :
ja: ベクトルの数量を要求中：

source: [yellow]No results found for '{target}' with the specified parameters.[/yellow]
fr: [yellow]Aucun résultat trouvé pour '' avec les paramètres spécifiés.[/yellow][yellow]Aucune source Gaia trouvée pour '{target}' dans le rayon donné.[/yellow]
ja: [yellow]指定されたパラメータで '' の結果は見つかりませんでした。[/yellow][yellow]指定されたbibcodeに一致する天体は見つかりませんでした。[/yellow]

source: JPL Horizons object
fr: Objet JPL Horizons
ja: JPL Horizonsオブジェクト

source: Query JPL Small-Body Database (SBDB). (s)
fr: Interroger la base de données JPL des petits corps (SBDB). (s)
ja: JPL小惑星データベース（SBDB）を照会します。(s)

source: Target small body (e.g., 'Ceres', '1P', '2023 BU').
fr: Petit corps cible (ex : 'Ceres', '1P', '2023 BU').
ja: ターゲットとなる小天体（例：'Ceres', '1P', '2023 BU'）。ターゲット小天体 (例: 'Ceres' (ケレス), '1P' (ハレー彗星), '2023 BU')。

source: Type of target identifier ('name', 'des', 'moid', 'spk') (default: let SBDB auto-detect).
fr: Type d'identifiant de cible ('name', 'des', 'moid', 'spk') (par défaut : laisser SBDB auto-détecter).Type d'identifiant de cible ('name', 'des', 'moid', 'spk') (par défaut : laisser la SBDB auto-détecter).
ja: ターゲット識別子のタイプ（'name', 'des', 'moid', 'spk'）（デフォルト：SBDBに自動検出させる）。ターゲット識別子の種類（'name'、'des'、'moid'、'spk'）（デフォルト：SBDBに自動検出させる）。

source: Include physical parameters.
fr: Inclure les paramètres physiques.
ja: 物理パラメータを含めます。

source: Include orbital elements.
fr: Inclure les éléments orbitaux.
ja: 軌道要素を含めます。

source: Include close-approach data.
fr: Inclure les données de rapprochement.
ja: 近接接近データを含めます。

source: Include radar observation data.
fr: Inclure les données d'observation radar.
ja: レーダー観測データを含めます。

source: Maximum number of rows to display for tables. Use -1 for all rows.
fr: Nombre maximal de lignes à afficher pour les tables. Utilisez -1 pour toutes les lignes.Nombre maximum de lignes à afficher pour les tables. Utilisez -1 pour toutes les lignes.
ja: テーブルに表示する最大行数。すべての行を表示するには-1を使用します。

source: Show all columns in output tables.
fr: Afficher toutes les colonnes dans les tables de sortie.
ja: 出力テーブルのすべての列を表示します。

source: [cyan]Querying JPL SBDB for target: '{target}'...[/cyan]
fr: [cyan]Interrogation de JPL SBDB pour la cible : ''...[/cyan][cyan]Interrogation de la SBDB du JPL pour la cible : '{target}'...[/cyan]
ja: [cyan]JPL SBDBでターゲット '' をクエリ中...[/cyan]

source: [green]Data found for '{target}'.[/green]
fr: [green]Données trouvées pour ''.[/green]
ja: [green]'' のデータが見つかりました。[/green]

source: JPL SBDB Data for {target}
fr: Données JPL SBDB pour
ja: のJPL SBDBデータ

source: JPL SBDB query for {target}
fr: Requête JPL SBDB pour
ja: のJPL SBDBクエリ

source: [bold magenta]SBDB Data for: {fullname}[/bold magenta]
fr: [bold magenta]Données SBDB pour : [/bold magenta]
ja: [bold magenta]SBDBデータ：[/bold magenta]

source: [green]Primary data saved to {file_path}[/green]
fr: [green]Données principales enregistrées dans [/green]
ja: [green]主要データは に保存されました[/green]

source: [red]Could not save non-table data as JSON: {error}[/red]
fr: [red]Impossible d'enregistrer des données non tabulaires au format JSON : [/red][red]Impossible d'enregistrer les données non-tabulaires au format JSON : {error}[/red]
ja: [red]非テーブルデータをJSONとして保存できませんでした：[/red][red]テーブル以外のデータをJSONとして保存できませんでした: {error}[/red]

source: [yellow]No information found for target '{target}'.[/yellow]
fr: [yellow]Aucune information trouvée pour la cible ''.[/yellow]
ja: [yellow]ターゲット '' の情報は見つかりませんでした。[/yellow]

source: JPL SBDB object
fr: Objet JPL SBDB
ja: JPL SBDBオブジェクト

source: Query the Mikulski Archive for Space Telescopes
fr: Interroger les archives Mikulski pour les télescopes spatiaux.
ja: ミクルスキ宇宙望遠鏡アーカイブを照会します。

source: Query MAST for observations of an object.
fr: Interroger MAST pour des observations d'un objet.
ja: 天体の観測についてMASTにクエリします。

source: Name of the astronomical object.
fr: Nom de l'objet astronomique.
ja: 天体名。

source: Search radius around the object.
fr: Rayon de recherche autour de l'objet.
ja: オブジェクト周辺の検索半径。

source: Observation collection (e.g., 'HST', 'TESS').
fr: Collection d'observations (ex : 'HST', 'TESS').
ja: 観測コレクション（例：'HST', 'TESS'）。

source: Instrument name (e.g., 'WFC3', 'ACS').
fr: Nom de l'instrument (ex : 'WFC3', 'ACS').
ja: 機器名（例：'WFC3', 'ACS'）。

source: [cyan]Querying MAST for object: '{object_name}'...[/cyan]
fr: [cyan]Interrogation de MAST pour l'objet : ''...[/cyan]
ja: [cyan]MASTでオブジェクト '' をクエリ中...[/cyan]

source: [green]Found {count} observation(s) for '{object_name}'.[/green]
fr: [green]Trouvé observation(s) pour ''.[/green]
ja: [green]'' の観測が 件見つかりました。[/green][green]'{object_name}' の観測データが {count} 件見つかりました。[/green]

source: MAST Observations for {object_name}
fr: Observations MAST pour
ja: のMAST観測

source: MAST object query
fr: Requête objet MAST
ja: MASTオブジェクトクエリ

source: [yellow]No observations found for object '{object_name}' with specified criteria.[/yellow]
fr: [yellow]Aucune observation trouvée pour l'objet '' avec les critères spécifiés.[/yellow][yellow]Aucune observation trouvée pour l'objet '{object_name}' avec les critères spécifiés.[/yellow]
ja: [yellow]オブジェクト '' の観測は指定された条件で見つかりませんでした。[/yellow][yellow]指定された基準では、天体 '{object_name}' の観測データは見つかりませんでした。[/yellow]

source: Query MAST for observations in a sky region.
fr: Interroger MAST pour des observations dans une région du ciel.
ja: 空の領域の観測についてMASTにクエリします。

source: Coordinates (e.g., '10.68h +41.26d', 'M101').
fr: Coordonnées (ex : '10.68h +41.26d', 'M101').
ja: 座標（例：'10.68h +41.26d', 'M101'）。

source: Observation collection.
fr: Collection d'observations.
ja: 観測コレクション。

source: Instrument name.
fr: Nom de l'instrument.
ja: 機器名。

source: [cyan]Querying MAST for region: '{coordinates}' with radius '{radius}'...[/cyan]
fr: [cyan]Interrogation de MAST pour la région : '' avec un rayon ''...[/cyan][cyan]Interrogation de MAST pour la région : '{coordinates}' avec un rayon de '{radius}'...[/cyan]
ja: [cyan]MASTで領域 '' を半径 '' でクエリ中...[/cyan][cyan]領域 '{coordinates}'、半径 '{radius}' のMASTデータを照会中...[/cyan]

source: [green]Found {count} observation(s) in the region.[/green]
fr: [green]Trouvé observation(s) dans la région.[/green]
ja: [green]領域で 件の観測が見つかりました。[/green]

source: MAST Observations for Region
fr: Observations MAST pour la région
ja: MAST領域観測

source: MAST region query
fr: Requête région MAST
ja: MAST領域クエリ

source: [yellow]No observations found for the specified region with given criteria.[/yellow]
fr: [yellow]Aucune observation trouvée pour la région spécifiée avec les critères donnés.[/yellow][yellow]Aucune observation trouvée pour la région spécifiée avec les critères donnés.[/yellow]
ja: [yellow]指定された条件で指定された領域の観測は見つかりませんでした。[/yellow][yellow]指定された基準では、指定された領域の観測データは見つかりませんでした。[/yellow]

source: MAST region
fr: Région MAST
ja: MAST領域

source: Get data product URLs for given observation IDs.
fr: Obtenir les URL des produits de données pour les ID d'observation donnés.Obtenir les URL des produits de données pour les ID d'observation donnés.
ja: 指定された観測IDのデータプロダクトURLを取得します。

source: List of observation IDs.
fr: Liste des ID d'observation.
ja: 観測IDのリスト。

source: Product type(s) (e.g., 'SCIENCE', 'PREVIEW').
fr: Type(s) de produit(s) (ex : 'SCIENCE', 'PREVIEW').
ja: プロダクトタイプ（例：'SCIENCE', 'PREVIEW'）。

source: [cyan]Fetching product list for obs ID(s): {obs_id_list}...[/cyan]
fr: [cyan]Récupération de la liste des produits pour les ID d'obs : ...[/cyan][cyan]Récupération de la liste des produits pour le(s) ID d'observation : {obs_id_list}...[/cyan]
ja: [cyan]観測IDのプロダクトリストを取得中：...[/cyan]

source: [green]Found {count} data products.[/green]
fr: [green]Trouvé produits de données.[/green]
ja: [green] 件のデータプロダクトが見つかりました。[/green]

source: MAST Data Products
fr: Produits de données MAST
ja: MASTデータプロダクト

source: MAST products list
fr: Liste des produits MAST
ja: MASTプロダクトリスト

source: [info]Use 'aqc mast download-products <obs_id> ...' or 'astroquery.mast.Observations.download_products()' to download.[/info]
fr: [info]Utilisez 'aqc mast download-products <obs_id> ...' ou 'astroquery.mast.Observations.download_products()' pour télécharger.[/info][info]Utilisez 'aqc mast download-products <obs_id> ...' ou 'astroquery.mast.Observations.download_products()' pour télécharger.[/info]
ja: [info]'aqc mast download-products <obs_id> ...' または 'astroquery.mast.Observations.download_products()' を使用してダウンロードしてください。[/info][info]ダウンロードするには 'aqc mast download-products <obs_id> ...' または 'astroquery.mast.Observations.download_products()' を使用してください。[/info]

source: [yellow]No data products found for the given observation ID(s) and criteria.[/yellow]
fr: [yellow]Aucun produit de données trouvé pour le(s) ID(s) d'observation et les critères donnés.[/yellow][yellow]Aucun produit de données trouvé pour les ID d'observation et les critères donnés.[/yellow]
ja: [yellow]指定された観測IDと条件のデータプロダクトは見つかりませんでした。[/yellow][yellow]指定された観測IDおよび基準に一致するデータプロダクトは見つかりませんでした。[/yellow]

source: MAST get_product_urls
fr: MAST obtenir les URL de produits

source: Query the NASA/IPAC Extragalactic Database
fr: Interroger la base de données extragalactique NASA/IPAC.
ja: NASA/IPAC銀河系外データベースを照会します。

source: Query NED for an object by name.
fr: Interroger NED pour un objet par nom.
ja: 名前でオブジェクトについてNEDにクエリします。

source: Name of the extragalactic object.
fr: Nom de l'objet extragalactique.
ja: 銀河系外天体名。

source: Maximum number of objects to display (usually 1 for direct name).
fr: Nombre maximal d'objets à afficher (généralement 1 pour un nom direct).Nombre maximum d'objets à afficher (généralement 1 pour un nom direct).
ja: 表示するオブジェクトの最大数（直接名の場合は通常1）。

source: [cyan]Querying NED for object: '{object_name}'...[/cyan]
fr: [cyan]Interrogation de NED pour l'objet : ''...[/cyan]
ja: [cyan]NEDでオブジェクト '' をクエリ中...[/cyan]

source: [green]Found information for '{object_name}'.[/green]
fr: [green]Informations trouvées pour ''.[/green]
ja: [green]'' の情報が見つかりました。[/green]

source: NED Data for {object_name}
fr: Données NED pour
ja: のNEDデータ

source: NED object query
fr: Requête objet NED
ja: NEDオブジェクトクエリ

source: NED object
fr: Objet NED
ja: NEDオブジェクト

source: Query NED for objects in a sky region.
fr: Interroger NED pour les objets dans une région du ciel.
ja: 空の領域のオブジェクトについてNEDにクエリします。

source: Equinox of coordinates (e.g., 'J2000', 'B1950').
fr: Équinoxe des coordonnées (ex : 'J2000', 'B1950').
ja: 座標の分点（例：'J2000', 'B1950'）。

source: [cyan]Querying NED for region: '{coordinates}' with radius '{radius}'...[/cyan]
fr: [cyan]Interrogation de NED pour la région : '' avec un rayon ''...[/cyan][cyan]Interrogation de NED pour la région : '{coordinates}' avec un rayon de '{radius}'...[/cyan]
ja: [cyan]NEDで領域 '' を半径 '' でクエリ中...[/cyan][cyan]領域 '{coordinates}'、半径 '{radius}' のNEDデータを照会中...[/cyan]

source: [green]Found {count} object(s) in the region.[/green]
fr: [green]Trouvé objet(s) dans la région.[/green]
ja: [green]領域で 件のオブジェクトが見つかりました。[/green]

source: NED Objects in Region
fr: Objets NED dans la région
ja: 領域内のNEDオブジェクト

source: NED region query
fr: Requête région NED
ja: NED領域クエリ

source: [yellow]No objects found in the specified region.[/yellow]
fr: [yellow]Aucun objet trouvé dans la région spécifiée.[/yellow]
ja: [yellow]指定された領域にオブジェクトは見つかりませんでした。[/yellow]

source: NED region
fr: Région NED
ja: NED領域

source: Get image metadata for an object from NED.
fr: Obtenir les métadonnées d'image pour un objet de NED.
ja: NEDからオブジェクトの画像メタデータを取得します。

source: Maximum number of image entries to display. Use -1 for all rows.
fr: Nombre maximal d'entrées d'image à afficher. Utilisez -1 pour toutes les lignes.Nombre maximum d'entrées d'image à afficher. Utilisez -1 pour toutes les lignes.
ja: 表示する画像エントリの最大数。すべての行を表示するには-1を使用します。表示する画像エントリの最大数。すべての行を表示するには -1 を使用します。

source: [cyan]Fetching image list from NED for object: '{object_name}'...[/cyan]
fr: [cyan]Récupération de la liste d'images de NED pour l'objet : ''...[/cyan][cyan]Récupération de la liste d'images de NED pour l'objet : '{object_name}'...[/cyan]
ja: [cyan]NEDからオブジェクト '' の画像リストを取得中...[/cyan]

source: [green]Found {count} image entries for '{object_name}'.[/green]
fr: [green]Trouvé entrées d'image pour ''.[/green]
ja: [green]'' の画像エントリが 件見つかりました。[/green][green]'{object_name}' の画像エントリが {count} 件見つかりました。[/green]
